{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. **STEP 8: DETERMINE SAMPLE WITH COMPLETE DATA ON SLEEP TOTAL SCORE IN 2006, DEMENTIA PROBABILITY DATA AT 2006, AND WHERE RESPONDENT'S AGE IS >50 IN 2006**
. 
. use HRS_PROJECTSLEEPCONGMORT_finLONG,clear
{txt}
{com}. 
. 
. **AGE >50 in 2006**
. 
. capture drop sample50plus2006
{txt}
{com}. gen sample50plus2006=.
{txt}(43,561 missing values generated)

{com}. replace sample50plus2006=1 if r8agey_e>50 & r8agey_e~=.
{txt}(17,809 real changes made)

{com}. replace sample50plus2006=0 if sample50plus2006~=1 & r8agey_e~=.
{txt}(660 real changes made)

{com}. 
. tab sample50plus2006

{txt}sample50plu {c |}
      s2006 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        660        3.57        3.57
{txt}          1 {c |}{res}     17,809       96.43      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     18,469      100.00
{txt}
{com}. 
. capture drop samplealivein2006
{txt}
{com}. gen samplealivein2006=.
{txt}(43,561 missing values generated)

{com}. replace samplealivein2006=1 if inw8==1
{txt}(18,469 real changes made)

{com}. replace samplealivein2006=0 if samplealivein2006~=1
{txt}(25,092 real changes made)

{com}. 
. tab samplealivein2006

{txt}samplealive {c |}
     in2006 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     25,092       57.60       57.60
{txt}          1 {c |}{res}     18,469       42.40      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     43,561      100.00
{txt}
{com}. 
. capture drop samplepoorsleep2006
{txt}
{com}. gen samplepoorsleep2006=.
{txt}(43,561 missing values generated)

{com}. replace samplepoorsleep2006=1 if poorsleep_2006~=. 
{txt}(18,242 real changes made)

{com}. replace samplepoorsleep2006=0 if samplepoorsleep2006~=1
{txt}(25,319 real changes made)

{com}. 
. tab samplepoorsleep2006 

{txt}samplepoors {c |}
   leep2006 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     25,319       58.12       58.12
{txt}          1 {c |}{res}     18,242       41.88      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     43,561      100.00
{txt}
{com}. 
. capture drop sampledementia
{txt}
{com}. gen sampledementia=.
{txt}(43,561 missing values generated)

{com}. replace sampledementia=1 if hrs_year==2006 & hurd_p!=. & expert_p!=. & lasso_p!=. 
{txt}(7,115 real changes made)

{com}. replace sampledementia=0 if sampledementia~=1
{txt}(36,446 real changes made)

{com}. 
. tab sampledementia

{txt}sampledemen {c |}
        tia {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     36,446       83.67       83.67
{txt}          1 {c |}{res}      7,115       16.33      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     43,561      100.00
{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
HRS_PROJECTSLEEPCONGMORT_finLONG.dta{rm}
saved
{p_end}

{com}. 
. capture drop sample_final
{txt}
{com}. gen sample_final=.
{txt}(43,561 missing values generated)

{com}. replace sample_final=1 if sample50plus2006==1 & samplealivein2006==1 & samplepoorsleep2006==1 & sampledementia==1 & kwgtr~=. 
{txt}(6,991 real changes made)

{com}. replace sample_final=0 if sample_final~=1
{txt}(36,570 real changes made)

{com}. 
. tab sample_final

{txt}sample_fina {c |}
          l {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     36,570       83.95       83.95
{txt}          1 {c |}{res}      6,991       16.05      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     43,561      100.00
{txt}
{com}. 
. save HRS_PROJECTSLEEPCONGMORT_finWIDE, replace
{txt}{p 0 4 2}
file {bf}
HRS_PROJECTSLEEPCONGMORT_finWIDE.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. **STEP 9: MORTALITY VARIABLES FROM 2008 THROUGH 2020: TRACKER FILE INW**
. 
. **dead vs. alive: 2008-2020
. 
. capture drop died
{txt}
{com}. gen died=.
{txt}(43,561 missing values generated)

{com}. replace died=1 if (sample_final==1 & knowndeceasedyr~=. & knowndeceasedmo~=.)
{txt}(4,938 real changes made)

{com}. replace died=0 if died!=1 & sample_final==1
{txt}(2,053 real changes made)

{com}. 
. tab died if sample_final==1

       {txt}died {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      2,053       29.37       29.37
{txt}          1 {c |}{res}      4,938       70.63      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      6,991      100.00
{txt}
{com}. 
. 
. **Date of death: dod**
. 
. su knowndeceasedmo knowndeceasedyr if sample_final==1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
knowndecea~o {c |}{res}      4,940    7.217206    8.929908          1         98
{txt}knowndecea~r {c |}{res}      4,938    2012.807    4.056176       2001       2021
{txt}
{com}. tab1 knowndeceasedmo knowndeceasedyr if sample_final==1

{res}-> tabulation of knowndeceasedmo if sample_final==1 

      {txt}KNOWN {c |}
 DECEASED - {c |}
      MONTH {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        457        9.25        9.25
{txt}          2 {c |}{res}        413        8.36       17.61
{txt}          3 {c |}{res}        427        8.64       26.26
{txt}          4 {c |}{res}        426        8.62       34.88
{txt}          5 {c |}{res}        375        7.59       42.47
{txt}          6 {c |}{res}        376        7.61       50.08
{txt}          7 {c |}{res}        370        7.49       57.57
{txt}          8 {c |}{res}        361        7.31       64.88
{txt}          9 {c |}{res}        369        7.47       72.35
{txt}         10 {c |}{res}        466        9.43       81.78
{txt}         11 {c |}{res}        445        9.01       90.79
{txt}         12 {c |}{res}        415        8.40       99.19
{txt}         98 {c |}{res}         40        0.81      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,940      100.00

-> tabulation of knowndeceasedyr if sample_final==1 

      {txt}KNOWN {c |}
 DECEASED - {c |}
       YEAR {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       2001 {c |}{res}          2        0.04        0.04
{txt}       2005 {c |}{res}          1        0.02        0.06
{txt}       2006 {c |}{res}        163        3.30        3.36
{txt}       2007 {c |}{res}        368        7.45       10.81
{txt}       2008 {c |}{res}        367        7.43       18.25
{txt}       2009 {c |}{res}        382        7.74       25.98
{txt}       2010 {c |}{res}        401        8.12       34.10
{txt}       2011 {c |}{res}        378        7.65       41.76
{txt}       2012 {c |}{res}        368        7.45       49.21
{txt}       2013 {c |}{res}        367        7.43       56.64
{txt}       2014 {c |}{res}        348        7.05       63.69
{txt}       2015 {c |}{res}        330        6.68       70.37
{txt}       2016 {c |}{res}        325        6.58       76.95
{txt}       2017 {c |}{res}        309        6.26       83.21
{txt}       2018 {c |}{res}        316        6.40       89.61
{txt}       2019 {c |}{res}        292        5.91       95.52
{txt}       2020 {c |}{res}        203        4.11       99.64
{txt}       2021 {c |}{res}         18        0.36      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,938      100.00
{txt}
{com}. 
. capture drop deathmonth
{txt}
{com}. gen deathmonth=knowndeceasedmo if knowndeceasedmo~=98
{txt}(25,605 missing values generated)

{com}. 
. capture drop deathyear
{txt}
{com}. gen deathyear=knowndeceasedyr
{txt}(25,479 missing values generated)

{com}. 
. capture drop deathday
{txt}
{com}. gen deathday=14
{txt}
{com}. 
. capture drop dod
{txt}
{com}. gen dod=mdy(deathmonth, deathday, deathyear)
{txt}(25,609 missing values generated)

{com}. 
. **Date of entry: doenter**
. capture drop doenter
{txt}
{com}. gen doenter=mdy(01,01,2006)
{txt}
{com}. 
. **Date of exit if still alive: doexit**
. capture drop doexit
{txt}
{com}. gen doexit=mdy(12,31,2020) 
{txt}
{com}. 
. **Date of exit for censor or dead**
. capture drop doevent
{txt}
{com}. gen doevent=.
{txt}(43,561 missing values generated)

{com}. replace doevent=dod if died==1 & sample_final==1
{txt}(4,898 real changes made)

{com}. replace doevent=doexit if died==0 & sample_final==1
{txt}(2,053 real changes made)

{com}. 
. su doevent

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}doevent {c |}{res}      6,951    20300.17    1782.921      15140      22384
{txt}
{com}. 
. ***Estimated birth date**
. 
. capture drop dob
{txt}
{com}. gen dob=mdy(birthmo,14,birthyr)
{txt}(329 missing values generated)

{com}. 
. 
. 
. capture drop ageevent
{txt}
{com}. gen ageevent=(doevent-dob)/365.5
{txt}(36,610 missing values generated)

{com}. 
. capture drop ageenter
{txt}
{com}. gen ageenter=r8agey_e
{txt}(25,092 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
HRS_PROJECTSLEEPCONGMORT_finWIDE.dta{rm}
saved
{p_end}

{com}. 
. **STEP 10: STSET FOR MORTALITY OUTCOME***
. 
. capture drop AGE2006
{txt}
{com}. gen AGE2006=ageenter
{txt}(25,092 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
HRS_PROJECTSLEEPCONGMORT_finWIDE.dta{rm}
saved
{p_end}

{com}. 
. stset ageevent if sample_final==1, failure(died==1) enter(AGE2006) origin(AGE2006) scale(1)

{txt}Survival-time data settings

{col 10}Failure event: {res}died==1
{col 1}{txt}Observed time interval: {res}(origin, ageevent]
{col 6}{txt}Enter on or after: {res}time AGE2006
{col 6}{txt}Exit on or before: {res}failure
{col 6}{txt}Time for analysis: {res}(time-origin)
{col 17}{txt}Origin: {res}time AGE2006
{col 7}{txt}Keep observations 
{col 17}{help j_st_ifvsoptif:{bf:if} {it:exp}}: {res}sample_final==1

{txt}{hline 74}
{res}     43,561{txt}  total observations
{res}     36,570{txt}  ignored at outset because of {bf:if} {it:exp}
{res}         40{txt}  event time missing (ageevent>=.){col 61}PROBABLE ERROR
{res}          6{txt}  observations end on or before {bf:enter()}
{hline 74}
{res}      6,945{txt}  observations remaining, representing
{res}      4,892{txt}  failures in single-record/single-failure data
{res} 66,265.112{txt}  total analysis time at risk and under observation
                                                At risk from t = {res}        0
                                     {txt}Earliest observed entry t = {res}        0
                                          {txt}Last observed exit t = {res}   15.658
{txt}
{com}. 
. 
. stdescribe if sample_final==1

{col 10}{txt}Failure {bf:_d}: {res}died==1
{col 4}{txt}Analysis time {bf:_t}: {res}(ageevent-origin)
{col 14}{txt}Origin: {res}time AGE2006
{col 3}{txt}Enter on or after: {res}time AGE2006

{txt}{col 36}{c LT}{hline 14} Per subject {hline 14}{c RT}
Category{col 28}Total{col 41}Mean{col 54}Min{col 62}Median{col 76}Max
{hline 78}
Number of subjects    {res}      6945   
{txt}Number of records     {res}      6945           1           1          1          1

{txt}Entry time (first)                 {res}        0           0          0          0
{txt}Exit time (final)                  {res} 9.541413    .0998611   10.10123     15.658

{txt}Subjects with gap     {res}         0   
{txt}Time on gap           {res}         0   
{txt}Time at risk          {res} 66265.112    9.541413    .0998611   10.10123     15.658

{txt}Failures              {res}      4892    .7043916           0          1          1
{txt}{hline 78}

{com}. stsum if sample_final==1

{col 10}{txt}Failure {bf:_d}: {res}died==1
{col 4}{txt}Analysis time {bf:_t}: {res}(ageevent-origin)
{col 14}{txt}Origin: {res}time AGE2006
{col 3}{txt}Enter on or after: {res}time AGE2006

{txt}{col 10}{c |}{col 26}Incidence{col 40}Number of{col 52}{c LT}{hline 6} Survival time {hline 5}{c RT}
        {col 10}{c |} Time at risk{col 31}rate{col 41}subjects{col 57}25%{col 67}50%{col 77}75%
{hline 9}{c +}{hline 69}
   Total {c |} {res} 66,265.1117   .0738247{col 40}     6945   5.187416  10.10123         .
{txt}
{com}. strate if sample_final==1

{col 10}{txt}Failure {bf:_d}: {res}died==1
{col 4}{txt}Analysis time {bf:_t}: {res}(ageevent-origin)
{col 14}{txt}Origin: {res}time AGE2006
{col 3}{txt}Enter on or after: {res}time AGE2006

{txt}Estimated failure rates
Number of records = {res}6945
{txt}
  {c TLC}{hline 6}{c -}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c TRC}
  {c |} {res}   D         Y       Rate      Lower      Upper {txt}{c |}
  {c LT}{hline 6}{c -}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  {c |} {res}4892   6.6e+04   0.073825   0.071785   0.075923 {txt}{c |}
  {c BLC}{hline 6}{c -}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c BRC}
   Notes: Rate = D/Y = failures/person-time.
          Lower and Upper are bounds of 95% confidence intervals.


{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
HRS_PROJECTSLEEPCONGMORT_finWIDE.dta{rm}
saved
{p_end}

{com}. 
. capture log close
{smcl}
{com}{sf}{ul off}