{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. **STEP 17: TABLE S3: MED4WAY FOR POOR SLEEP AS EXPOSURE, DIFFERENT PROBABILITIES OF DEMENTIA AS MEDIATORS, AND ALL-CAUSE DEATH AS OUTCOME: FULL MODEL; OVERALL AND STRATIFIED BY SEX AND BY RACE/ETHNICITY***
. 
. **COVARIATES: NonWhite AGE2006 SEX  i.education  i.totwealth_2006 marital_2006 work_st_2006 i.smoking_2006 physic_act_2006 i.srh_2006  i.bmibr_2006 cardiometcondbr_2006
. 
. use finaldata_imputed_FINAL,clear
{txt}
{com}. 
. 
. 
. capture drop lnhurd_odds
{txt}
{com}. mi passive: gen lnhurd_odds=ln((hurd_p)/(1-hurd_p))
{res}{txt}{p}
(passive variable
{res}lnhurd_odds
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(35,952 missing values generated)
{it:m}=1:
(35,952 missing values generated)
{it:m}=2:
(35,952 missing values generated)
{it:m}=3:
(35,952 missing values generated)
{it:m}=4:
(35,952 missing values generated)
{it:m}=5:
(35,952 missing values generated)

{com}. 
. capture drop lnexpert_odds
{txt}
{com}. mi passive: gen lnexpert_odds=ln((expert_p)/(1-expert_p))
{res}{txt}{p}
(passive variable
{res}lnexpert_odds
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(35,850 missing values generated)
{it:m}=1:
(35,850 missing values generated)
{it:m}=2:
(35,850 missing values generated)
{it:m}=3:
(35,850 missing values generated)
{it:m}=4:
(35,850 missing values generated)
{it:m}=5:
(35,850 missing values generated)

{com}. 
. 
. capture drop lnlasso_odds
{txt}
{com}. mi passive: gen lnlasso_odds=ln((lasso_p)/(1-lasso_p))
{res}{txt}{p}
(passive variable
{res}lnlasso_odds
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(36,394 missing values generated)
{it:m}=1:
(36,394 missing values generated)
{it:m}=2:
(36,394 missing values generated)
{it:m}=3:
(36,394 missing values generated)
{it:m}=4:
(36,394 missing values generated)
{it:m}=5:
(36,394 missing values generated)

{com}. 
. 
. capture drop Men
{txt}
{com}. mi passive: gen Men=1 if SEX==1 & sample_final==1
{res}{txt}{p}
(passive variable
{res}Men
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(40,630 missing values generated)
{it:m}=1:
(40,630 missing values generated)
{it:m}=2:
(40,630 missing values generated)
{it:m}=3:
(40,630 missing values generated)
{it:m}=4:
(40,630 missing values generated)
{it:m}=5:
(40,630 missing values generated)

{com}. mi passive: replace Men=0 if Men~=1 & SEX~=. & sample_final==1
{res}{txt}{it:m}=0:
(4,060 real changes made)
{it:m}=1:
(4,060 real changes made)
{it:m}=2:
(4,060 real changes made)
{it:m}=3:
(4,060 real changes made)
{it:m}=4:
(4,060 real changes made)
{it:m}=5:
(4,060 real changes made)

{com}. 
. capture drop Women
{txt}
{com}. mi passive: gen Women=1 if SEX==2 & sample_final==1
{res}{txt}{p}
(passive variable
{res}Women
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(39,501 missing values generated)
{it:m}=1:
(39,501 missing values generated)
{it:m}=2:
(39,501 missing values generated)
{it:m}=3:
(39,501 missing values generated)
{it:m}=4:
(39,501 missing values generated)
{it:m}=5:
(39,501 missing values generated)

{com}. mi passive: replace Women=0 if Women~=1 & SEX~=. & sample_final==1
{res}{txt}{it:m}=0:
(2,931 real changes made)
{it:m}=1:
(2,931 real changes made)
{it:m}=2:
(2,931 real changes made)
{it:m}=3:
(2,931 real changes made)
{it:m}=4:
(2,931 real changes made)
{it:m}=5:
(2,931 real changes made)

{com}. 
. capture drop NHW
{txt}
{com}. mi passive: gen NHW=1 if RACE_ETHN==1 & sample_final==1
{res}{txt}{p}
(passive variable
{res}NHW
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(37,895 missing values generated)
{it:m}=1:
(37,895 missing values generated)
{it:m}=2:
(37,895 missing values generated)
{it:m}=3:
(37,895 missing values generated)
{it:m}=4:
(37,895 missing values generated)
{it:m}=5:
(37,895 missing values generated)

{com}. mi passive: replace NHW=0 if NHW~=1 & RACE_ETHN~=. & sample_final==1
{res}{txt}{it:m}=0:
(1,325 real changes made)
{it:m}=1:
(1,325 real changes made)
{it:m}=2:
(1,325 real changes made)
{it:m}=3:
(1,325 real changes made)
{it:m}=4:
(1,325 real changes made)
{it:m}=5:
(1,325 real changes made)

{com}. 
. capture drop NHB
{txt}
{com}. mi passive: gen NHB=1 if RACE_ETHN==2 & sample_final==1
{res}{txt}{p}
(passive variable
{res}NHB
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(42,705 missing values generated)
{it:m}=1:
(42,705 missing values generated)
{it:m}=2:
(42,705 missing values generated)
{it:m}=3:
(42,705 missing values generated)
{it:m}=4:
(42,705 missing values generated)
{it:m}=5:
(42,705 missing values generated)

{com}. mi passive: replace NHB=0 if NHB~=1 & RACE_ETHN~=. & sample_final==1
{res}{txt}{it:m}=0:
(6,135 real changes made)
{it:m}=1:
(6,135 real changes made)
{it:m}=2:
(6,135 real changes made)
{it:m}=3:
(6,135 real changes made)
{it:m}=4:
(6,135 real changes made)
{it:m}=5:
(6,135 real changes made)

{com}. 
. 
. capture drop HISP
{txt}
{com}. mi passive: gen HISP=1 if RACE_ETHN==3 & sample_final==1
{res}{txt}{p}
(passive variable
{res}HISP
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(43,092 missing values generated)
{it:m}=1:
(43,092 missing values generated)
{it:m}=2:
(43,092 missing values generated)
{it:m}=3:
(43,092 missing values generated)
{it:m}=4:
(43,092 missing values generated)
{it:m}=5:
(43,092 missing values generated)

{com}. mi passive: replace HISP=0 if HISP~=1 & RACE_ETHN~=. & sample_final==1 
{res}{txt}{it:m}=0:
(6,522 real changes made)
{it:m}=1:
(6,522 real changes made)
{it:m}=2:
(6,522 real changes made)
{it:m}=3:
(6,522 real changes made)
{it:m}=4:
(6,522 real changes made)
{it:m}=5:
(6,522 real changes made)

{com}. 
. 
. capture drop OTHER
{txt}
{com}. mi passive: gen OTHER=1 if RACE_ETHN==4 & sample_final==1
{res}{txt}{p}
(passive variable
{res}OTHER
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(43,561 missing values generated)
{it:m}=1:
(43,561 missing values generated)
{it:m}=2:
(43,561 missing values generated)
{it:m}=3:
(43,561 missing values generated)
{it:m}=4:
(43,561 missing values generated)
{it:m}=5:
(43,561 missing values generated)

{com}. mi passive: replace OTHER=0 if OTHER~=1 & RACE_ETHN~=. & sample_final==1
{res}{txt}{it:m}=0:
(6,991 real changes made)
{it:m}=1:
(6,991 real changes made)
{it:m}=2:
(6,991 real changes made)
{it:m}=3:
(6,991 real changes made)
{it:m}=4:
(6,991 real changes made)
{it:m}=5:
(6,991 real changes made)

{com}. 
. 
. capture drop NonWhite
{txt}
{com}. mi passive: gen NonWhite=0 if RACE_ETHN==1 & sample_final==1
{res}{txt}{p}
(passive variable
{res}NonWhite
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(37,895 missing values generated)
{it:m}=1:
(37,895 missing values generated)
{it:m}=2:
(37,895 missing values generated)
{it:m}=3:
(37,895 missing values generated)
{it:m}=4:
(37,895 missing values generated)
{it:m}=5:
(37,895 missing values generated)

{com}. mi passive: replace NonWhite=1 if RACE_ETHN!=1 & RACE_ETHN!=. & sample_final==1
{res}{txt}{it:m}=0:
(1,325 real changes made)
{it:m}=1:
(1,325 real changes made)
{it:m}=2:
(1,325 real changes made)
{it:m}=3:
(1,325 real changes made)
{it:m}=4:
(1,325 real changes made)
{it:m}=5:
(1,325 real changes made)

{com}. 
. save, replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. capture mi stset ageevent [pweight = kwgtr] if sample_final==1, failure(died==1) enter(AGE2006) origin(AGE2006) id(HHIDPN) scale(1)
{txt}
{com}. 
. capture drop educationg* totalwealth_2006g* marital_2006g* smoking_2006g* physic_act_2006g* srh_2006g* bmibr_2006g*  cardiometcondbr_2006g*
{txt}
{com}. 
. tab education,generate(educationg)

  {txt}education {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     64,385       25.42       25.42
{txt}          2 {c |}{res}     12,398        4.89       30.32
{txt}          3 {c |}{res}     71,253       28.13       58.45
{txt}          4 {c |}{res}     56,752       22.41       80.85
{txt}          5 {c |}{res}     48,493       19.15      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    253,281      100.00
{txt}
{com}. 
. tab totwealth_2006, generate(totalwealth_2006g)

{txt}totwealth_2 {c |}
        006 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     38,448       34.70       34.70
{txt}          2 {c |}{res}     60,978       55.03       89.72
{txt}          3 {c |}{res}      9,396        8.48       98.20
{txt}          4 {c |}{res}      1,554        1.40       99.60
{txt}          5 {c |}{res}        438        0.40      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    110,814      100.00
{txt}
{com}. 
. tab marital_2006, generate(marital_2006g)

{txt}marital_200 {c |}
          6 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      3,277        2.96        2.96
{txt}          2 {c |}{res}     72,317       65.26       68.22
{txt}          3 {c |}{res}     12,157       10.97       79.19
{txt}          4 {c |}{res}     23,061       20.81      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    110,812      100.00
{txt}
{com}. 
. tab smoking_2006, generate(smoking_2006g)

{txt}smoking_200 {c |}
          6 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     47,368       42.89       42.89
{txt}          2 {c |}{res}     47,821       43.30       86.19
{txt}          3 {c |}{res}     15,250       13.81      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    110,439      100.00
{txt}
{com}. 
. tab physic_act_2006, generate(physic_act_2006g)

{txt}physic_act_ {c |}
       2006 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     24,705       22.30       22.30
{txt}          2 {c |}{res}     22,890       20.66       42.96
{txt}          3 {c |}{res}     63,187       57.04      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    110,782      100.00
{txt}
{com}. 
. tab srh_2006, generate(srh_2006g)

   {txt}srh_2006 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     77,555       70.01       70.01
{txt}          2 {c |}{res}     33,219       29.99      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    110,774      100.00
{txt}
{com}. 
. tab bmibr_2006, generate(bmibr_2006g)

 {txt}bmibr_2006 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     35,584       32.25       32.25
{txt}          2 {c |}{res}     41,644       37.74       69.99
{txt}          3 {c |}{res}     33,113       30.01      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    110,341      100.00
{txt}
{com}.  
. tab cardiometcondbr_2006, generate(cardiometcondbr_2006g)

{txt}cardiometco {c |}
  ndbr_2006 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     37,632       33.96       33.96
{txt}          2 {c |}{res}     63,186       57.02       90.98
{txt}          3 {c |}{res}      9,996        9.02      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    110,814      100.00
{txt}
{com}. 
. 
. *****************************OVERALL*******************************
. capture drop zpoorsleep_2006 
{txt}
{com}. capture drop zpoorsleepalt_2006
{txt}
{com}. capture drop zlnhurd_odds 
{txt}
{com}. capture drop zlnexpert_odds 
{txt}
{com}. capture drop zlnlasso_odds
{txt}
{com}. foreach x of varlist poorsleep_2006 poorsleepalt_2006 lnhurd_odds lnexpert_odds lnlasso_odds {c -(}
{txt}  2{com}.         mi passive: egen z`x'=std(`x') if sample_final==1
{txt}  3{com}. {c )-}
{res}{txt}{p}
(passive variables
{res}zpoorsleep_2006 zpoorsleepalt_2006 zlnhurd_odds zlnexpert_odds zlnlasso_odds
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way zpoorsleep_2006 `m' AGE2006 SEX NonWhite if sample_final==1 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     6,991
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0413436{col 26}{space 2} .0154073{col 37}{space 1}    2.68{col 46}{space 3}0.007{col 54}{space 4} .0111458{col 67}{space 3} .0715414
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0379357{col 26}{space 2} .0146345{col 37}{space 1}    2.59{col 46}{space 3}0.010{col 54}{space 4} .0092526{col 67}{space 3} .0666189
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0006892{col 26}{space 2} .0028962{col 37}{space 1}   -0.24{col 46}{space 3}0.812{col 54}{space 4}-.0063655{col 67}{space 3} .0049872
{txt}ereri_intmed {c |}{col 14}{res}{space 2}  .000036{col 26}{space 2} .0001695{col 37}{space 1}    0.21{col 46}{space 3}0.832{col 54}{space 4}-.0002962{col 67}{space 3} .0003682
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0040611{col 26}{space 2} .0034271{col 37}{space 1}    1.18{col 46}{space 3}0.236{col 54}{space 4}-.0026559{col 67}{space 3} .0107781
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     6,991
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0327432{col 26}{space 2} .0154999{col 37}{space 1}    2.11{col 46}{space 3}0.035{col 54}{space 4}  .002364{col 67}{space 3} .0631224
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0309697{col 26}{space 2} .0142562{col 37}{space 1}    2.17{col 46}{space 3}0.030{col 54}{space 4} .0030281{col 67}{space 3} .0589114
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0136112{col 26}{space 2} .0041018{col 37}{space 1}   -3.32{col 46}{space 3}0.001{col 54}{space 4}-.0216506{col 67}{space 3}-.0055719
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0015921{col 26}{space 2} .0007322{col 37}{space 1}   -2.17{col 46}{space 3}0.030{col 54}{space 4}-.0030272{col 67}{space 3}-.0001569
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0169768{col 26}{space 2}  .004838{col 37}{space 1}    3.51{col 46}{space 3}0.000{col 54}{space 4} .0074945{col 67}{space 3} .0264591
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     6,991
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0324056{col 26}{space 2} .0154411{col 37}{space 1}    2.10{col 46}{space 3}0.036{col 54}{space 4} .0021416{col 67}{space 3} .0626696
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}  .036473{col 26}{space 2} .0142518{col 37}{space 1}    2.56{col 46}{space 3}0.010{col 54}{space 4} .0085399{col 67}{space 3}  .064406
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0112649{col 26}{space 2} .0040438{col 37}{space 1}   -2.79{col 46}{space 3}0.005{col 54}{space 4}-.0191907{col 67}{space 3}-.0033391
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0005823{col 26}{space 2} .0004417{col 37}{space 1}   -1.32{col 46}{space 3}0.187{col 54}{space 4} -.001448{col 67}{space 3} .0002834
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0077798{col 26}{space 2} .0046695{col 37}{space 1}    1.67{col 46}{space 3}0.096{col 54}{space 4}-.0013722{col 67}{space 3} .0169319
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. *****SENSITIVITY ANALYSIS, OVERALL*******
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way zpoorsleepalt_2006 `m' AGE2006 SEX NonWhite if sample_final==1 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     6,991
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0309024{col 26}{space 2} .0152712{col 37}{space 1}    2.02{col 46}{space 3}0.043{col 54}{space 4} .0009713{col 67}{space 3} .0608334
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0302486{col 26}{space 2} .0145375{col 37}{space 1}    2.08{col 46}{space 3}0.037{col 54}{space 4} .0017557{col 67}{space 3} .0587416
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0009163{col 26}{space 2}  .002958{col 37}{space 1}   -0.31{col 46}{space 3}0.757{col 54}{space 4} -.006714{col 67}{space 3} .0048814
{txt}ereri_intmed {c |}{col 14}{res}{space 2} 3.25e-06{col 26}{space 2}  .000066{col 37}{space 1}    0.05{col 46}{space 3}0.961{col 54}{space 4}-.0001261{col 67}{space 3} .0001326
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0015668{col 26}{space 2}  .003409{col 37}{space 1}    0.46{col 46}{space 3}0.646{col 54}{space 4}-.0051147{col 67}{space 3} .0082482
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     6,991
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0223145{col 26}{space 2} .0153304{col 37}{space 1}    1.46{col 46}{space 3}0.146{col 54}{space 4}-.0077326{col 67}{space 3} .0523616
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0233194{col 26}{space 2} .0141721{col 37}{space 1}    1.65{col 46}{space 3}0.100{col 54}{space 4}-.0044575{col 67}{space 3} .0510962
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0148883{col 26}{space 2} .0040651{col 37}{space 1}   -3.66{col 46}{space 3}0.000{col 54}{space 4}-.0228558{col 67}{space 3}-.0069208
{txt}ereri_intmed {c |}{col 14}{res}{space 2} -.001674{col 26}{space 2} .0007357{col 37}{space 1}   -2.28{col 46}{space 3}0.023{col 54}{space 4}-.0031159{col 67}{space 3}-.0002321
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0155575{col 26}{space 2} .0048172{col 37}{space 1}    3.23{col 46}{space 3}0.001{col 54}{space 4}  .006116{col 67}{space 3}  .024999
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     6,991
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0217335{col 26}{space 2} .0152773{col 37}{space 1}    1.42{col 46}{space 3}0.155{col 54}{space 4}-.0082095{col 67}{space 3} .0516764
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0290006{col 26}{space 2} .0141655{col 37}{space 1}    2.05{col 46}{space 3}0.041{col 54}{space 4} .0012367{col 67}{space 3} .0567644
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0124479{col 26}{space 2} .0040104{col 37}{space 1}   -3.10{col 46}{space 3}0.002{col 54}{space 4}-.0203082{col 67}{space 3}-.0045876
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0005014{col 26}{space 2} .0004548{col 37}{space 1}   -1.10{col 46}{space 3}0.270{col 54}{space 4}-.0013927{col 67}{space 3} .0003899
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0056822{col 26}{space 2} .0046441{col 37}{space 1}    1.22{col 46}{space 3}0.221{col 54}{space 4}-.0034201{col 67}{space 3} .0147844
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. *****************************MEN*******************************
. capture drop zpoorsleep_2006 
{txt}
{com}. capture drop zpoorsleepalt_2006
{txt}
{com}. capture drop zlnhurd_odds 
{txt}
{com}. capture drop zlnexpert_odds 
{txt}
{com}. capture drop zlnlasso_odds
{txt}
{com}. foreach x of varlist poorsleep_2006 poorsleepalt_2006 lnhurd_odds lnexpert_odds lnlasso_odds {c -(}
{txt}  2{com}.         mi passive: egen z`x'=std(`x') if sample_final==1
{txt}  3{com}. {c )-}
{res}{txt}{p}
(passive variables
{res}zpoorsleep_2006 zpoorsleepalt_2006 zlnhurd_odds zlnexpert_odds zlnlasso_odds
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way zpoorsleep_2006 `m' AGE2006 SEX NonWhite if SEX==1 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     2,931
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}  .041739{col 26}{space 2}  .023752{col 37}{space 1}    1.76{col 46}{space 3}0.079{col 54}{space 4}-.0048141{col 67}{space 3} .0882922
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0418177{col 26}{space 2} .0226771{col 37}{space 1}    1.84{col 46}{space 3}0.065{col 54}{space 4}-.0026286{col 67}{space 3} .0862639
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0124901{col 26}{space 2} .0038647{col 37}{space 1}   -3.23{col 46}{space 3}0.001{col 54}{space 4}-.0200646{col 67}{space 3}-.0049155
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0022556{col 26}{space 2}  .001283{col 37}{space 1}   -1.76{col 46}{space 3}0.079{col 54}{space 4}-.0047702{col 67}{space 3}  .000259
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0146671{col 26}{space 2}  .006248{col 37}{space 1}    2.35{col 46}{space 3}0.019{col 54}{space 4} .0024213{col 67}{space 3} .0269129
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     2,931
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0468487{col 26}{space 2} .0240751{col 37}{space 1}    1.95{col 46}{space 3}0.052{col 54}{space 4}-.0003375{col 67}{space 3} .0940349
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0315026{col 26}{space 2}  .022614{col 37}{space 1}    1.39{col 46}{space 3}0.164{col 54}{space 4}-.0128201{col 67}{space 3} .0758253
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0072127{col 26}{space 2} .0046229{col 37}{space 1}   -1.56{col 46}{space 3}0.119{col 54}{space 4}-.0162734{col 67}{space 3} .0018481
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0017042{col 26}{space 2}  .001527{col 37}{space 1}   -1.12{col 46}{space 3}0.264{col 54}{space 4} -.004697{col 67}{space 3} .0012886
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0242629{col 26}{space 2} .0068658{col 37}{space 1}    3.53{col 46}{space 3}0.000{col 54}{space 4} .0108061{col 67}{space 3} .0377197
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     2,931
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0459227{col 26}{space 2} .0239378{col 37}{space 1}    1.92{col 46}{space 3}0.055{col 54}{space 4}-.0009945{col 67}{space 3}   .09284
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0358216{col 26}{space 2} .0227731{col 37}{space 1}    1.57{col 46}{space 3}0.116{col 54}{space 4}-.0088129{col 67}{space 3} .0804561
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0074135{col 26}{space 2} .0034671{col 37}{space 1}   -2.14{col 46}{space 3}0.032{col 54}{space 4}-.0142089{col 67}{space 3}-.0006181
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0016515{col 26}{space 2} .0012525{col 37}{space 1}   -1.32{col 46}{space 3}0.187{col 54}{space 4}-.0041063{col 67}{space 3} .0008033
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0191662{col 26}{space 2} .0069093{col 37}{space 1}    2.77{col 46}{space 3}0.006{col 54}{space 4} .0056243{col 67}{space 3} .0327081
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. *****SENSITIVITY ANALYSIS, MEN*******
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way zpoorsleepalt_2006 `m' AGE2006 SEX NonWhite if SEX==1 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     2,931
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0363938{col 26}{space 2} .0237137{col 37}{space 1}    1.53{col 46}{space 3}0.125{col 54}{space 4}-.0100842{col 67}{space 3} .0828717
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0385498{col 26}{space 2} .0226957{col 37}{space 1}    1.70{col 46}{space 3}0.089{col 54}{space 4} -.005933{col 67}{space 3} .0830326
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0126092{col 26}{space 2} .0038722{col 37}{space 1}   -3.26{col 46}{space 3}0.001{col 54}{space 4}-.0201986{col 67}{space 3}-.0050198
{txt}ereri_intmed {c |}{col 14}{res}{space 2} -.002007{col 26}{space 2} .0012411{col 37}{space 1}   -1.62{col 46}{space 3}0.106{col 54}{space 4}-.0044395{col 67}{space 3} .0004255
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0124602{col 26}{space 2} .0061561{col 37}{space 1}    2.02{col 46}{space 3}0.043{col 54}{space 4} .0003943{col 67}{space 3}  .024526
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     2,931
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0415679{col 26}{space 2} .0239992{col 37}{space 1}    1.73{col 46}{space 3}0.083{col 54}{space 4}-.0054697{col 67}{space 3} .0886054
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0266189{col 26}{space 2} .0225919{col 37}{space 1}    1.18{col 46}{space 3}0.239{col 54}{space 4}-.0176605{col 67}{space 3} .0708983
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0079929{col 26}{space 2}  .004602{col 37}{space 1}   -1.74{col 46}{space 3}0.082{col 54}{space 4}-.0170127{col 67}{space 3}  .001027
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0020728{col 26}{space 2} .0015948{col 37}{space 1}   -1.30{col 46}{space 3}0.194{col 54}{space 4}-.0051986{col 67}{space 3}  .001053
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0250146{col 26}{space 2} .0068767{col 37}{space 1}    3.64{col 46}{space 3}0.000{col 54}{space 4} .0115365{col 67}{space 3} .0384927
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     2,931
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}  .040998{col 26}{space 2} .0238926{col 37}{space 1}    1.72{col 46}{space 3}0.086{col 54}{space 4}-.0058307{col 67}{space 3} .0878267
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0313463{col 26}{space 2} .0227546{col 37}{space 1}    1.38{col 46}{space 3}0.168{col 54}{space 4} -.013252{col 67}{space 3} .0759446
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0074983{col 26}{space 2}  .003495{col 37}{space 1}   -2.15{col 46}{space 3}0.032{col 54}{space 4}-.0143484{col 67}{space 3}-.0006483
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0017166{col 26}{space 2} .0012603{col 37}{space 1}   -1.36{col 46}{space 3}0.173{col 54}{space 4}-.0041868{col 67}{space 3} .0007537
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0188666{col 26}{space 2} .0068946{col 37}{space 1}    2.74{col 46}{space 3}0.006{col 54}{space 4} .0053535{col 67}{space 3} .0323798
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. 
. *****************************WOMEN*******************************
. capture drop zpoorsleep_2006 
{txt}
{com}. capture drop zpoorsleepalt_2006
{txt}
{com}. capture drop zlnhurd_odds 
{txt}
{com}. capture drop zlnexpert_odds 
{txt}
{com}. capture drop zlnlasso_odds
{txt}
{com}. foreach x of varlist poorsleep_2006 poorsleepalt_2006 lnhurd_odds lnexpert_odds lnlasso_odds {c -(}
{txt}  2{com}.         mi passive: egen z`x'=std(`x') if sample_final==1
{txt}  3{com}. {c )-}
{res}{txt}{p}
(passive variables
{res}zpoorsleep_2006 zpoorsleepalt_2006 zlnhurd_odds zlnexpert_odds zlnlasso_odds
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way zpoorsleep_2006 `m' AGE2006 SEX NonWhite if SEX==2 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     4,060
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0351552{col 26}{space 2} .0202557{col 37}{space 1}    1.74{col 46}{space 3}0.083{col 54}{space 4}-.0045453{col 67}{space 3} .0748556
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0302883{col 26}{space 2} .0189386{col 37}{space 1}    1.60{col 46}{space 3}0.110{col 54}{space 4}-.0068308{col 67}{space 3} .0674073
{txt}ereri_intref {c |}{col 14}{res}{space 2} .0040149{col 26}{space 2} .0046891{col 37}{space 1}    0.86{col 46}{space 3}0.392{col 54}{space 4}-.0051755{col 67}{space 3} .0132053
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0000474{col 26}{space 2} .0002736{col 37}{space 1}    0.17{col 46}{space 3}0.862{col 54}{space 4}-.0004888{col 67}{space 3} .0005836
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0008046{col 26}{space 2} .0045856{col 37}{space 1}    0.18{col 46}{space 3}0.861{col 54}{space 4} -.008183{col 67}{space 3} .0097922
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     4,060
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0230328{col 26}{space 2}  .020302{col 37}{space 1}    1.13{col 46}{space 3}0.257{col 54}{space 4}-.0167584{col 67}{space 3}  .062824
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0291695{col 26}{space 2} .0183238{col 37}{space 1}    1.59{col 46}{space 3}0.111{col 54}{space 4}-.0067444{col 67}{space 3} .0650833
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0186779{col 26}{space 2} .0063578{col 37}{space 1}   -2.94{col 46}{space 3}0.003{col 54}{space 4}-.0311389{col 67}{space 3}-.0062169
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0014674{col 26}{space 2} .0009128{col 37}{space 1}   -1.61{col 46}{space 3}0.108{col 54}{space 4}-.0032564{col 67}{space 3} .0003216
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0140086{col 26}{space 2} .0067756{col 37}{space 1}    2.07{col 46}{space 3}0.039{col 54}{space 4} .0007286{col 67}{space 3} .0272886
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     4,060
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0233512{col 26}{space 2} .0202816{col 37}{space 1}    1.15{col 46}{space 3}0.250{col 54}{space 4}-.0164001{col 67}{space 3} .0631025
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0348622{col 26}{space 2} .0181999{col 37}{space 1}    1.92{col 46}{space 3}0.055{col 54}{space 4}-.0008089{col 67}{space 3} .0705334
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0133611{col 26}{space 2} .0069685{col 37}{space 1}   -1.92{col 46}{space 3}0.055{col 54}{space 4}-.0270192{col 67}{space 3} .0002969
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0001329{col 26}{space 2} .0004406{col 37}{space 1}   -0.30{col 46}{space 3}0.763{col 54}{space 4}-.0009965{col 67}{space 3} .0007306
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}  .001983{col 26}{space 2} .0064427{col 37}{space 1}    0.31{col 46}{space 3}0.758{col 54}{space 4}-.0106444{col 67}{space 3} .0146105
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. 
. *****SENSITIVITY ANALYSIS, WOMEN*******
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way zpoorsleepalt_2006 `m' AGE2006 SEX NonWhite if SEX==2 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     4,060
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0212436{col 26}{space 2} .0199599{col 37}{space 1}    1.06{col 46}{space 3}0.287{col 54}{space 4}-.0178771{col 67}{space 3} .0603643
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0200739{col 26}{space 2} .0187163{col 37}{space 1}    1.07{col 46}{space 3}0.283{col 54}{space 4}-.0166095{col 67}{space 3} .0567573
{txt}ereri_intref {c |}{col 14}{res}{space 2} .0036149{col 26}{space 2} .0047921{col 37}{space 1}    0.75{col 46}{space 3}0.451{col 54}{space 4}-.0057774{col 67}{space 3} .0130073
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0001155{col 26}{space 2} .0002588{col 37}{space 1}   -0.45{col 46}{space 3}0.655{col 54}{space 4}-.0006228{col 67}{space 3} .0003917
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0023297{col 26}{space 2} .0045684{col 37}{space 1}   -0.51{col 46}{space 3}0.610{col 54}{space 4}-.0112835{col 67}{space 3} .0066242
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     4,060
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0092236{col 26}{space 2}  .019975{col 37}{space 1}    0.46{col 46}{space 3}0.644{col 54}{space 4}-.0299266{col 67}{space 3} .0483739
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0199201{col 26}{space 2} .0181507{col 37}{space 1}    1.10{col 46}{space 3}0.272{col 54}{space 4}-.0156545{col 67}{space 3} .0554947
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0202144{col 26}{space 2}  .006299{col 37}{space 1}   -3.21{col 46}{space 3}0.001{col 54}{space 4}-.0325603{col 67}{space 3}-.0078686
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0012756{col 26}{space 2} .0009076{col 37}{space 1}   -1.41{col 46}{space 3}0.160{col 54}{space 4}-.0030544{col 67}{space 3} .0005033
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0107936{col 26}{space 2} .0067233{col 37}{space 1}    1.61{col 46}{space 3}0.108{col 54}{space 4}-.0023838{col 67}{space 3}  .023971
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     4,060
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0088882{col 26}{space 2} .0199479{col 37}{space 1}    0.45{col 46}{space 3}0.656{col 54}{space 4}-.0302089{col 67}{space 3} .0479854
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0259514{col 26}{space 2} .0180253{col 37}{space 1}    1.44{col 46}{space 3}0.150{col 54}{space 4}-.0093777{col 67}{space 3} .0612804
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0155719{col 26}{space 2} .0068724{col 37}{space 1}   -2.27{col 46}{space 3}0.023{col 54}{space 4}-.0290416{col 67}{space 3}-.0021022
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0001363{col 26}{space 2} .0005395{col 37}{space 1}    0.25{col 46}{space 3}0.801{col 54}{space 4}-.0009212{col 67}{space 3} .0011937
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0016275{col 26}{space 2} .0063951{col 37}{space 1}   -0.25{col 46}{space 3}0.799{col 54}{space 4}-.0141616{col 67}{space 3} .0109066
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. 
. ***************************NHW*****************************************
. capture drop zpoorsleep_2006 
{txt}
{com}. capture drop zpoorsleepalt_2006
{txt}
{com}. capture drop zlnhurd_odds 
{txt}
{com}. capture drop zlnexpert_odds 
{txt}
{com}. capture drop zlnlasso_odds
{txt}
{com}. foreach x of varlist poorsleep_2006 poorsleepalt_2006 lnhurd_odds lnexpert_odds lnlasso_odds {c -(}
{txt}  2{com}.         mi passive: egen z`x'=std(`x') if sample_final==1
{txt}  3{com}. {c )-}
{res}{txt}{p}
(passive variables
{res}zpoorsleep_2006 zpoorsleepalt_2006 zlnhurd_odds zlnexpert_odds zlnlasso_odds
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way zpoorsleep_2006 `m' AGE2006 SEX NonWhite if NonWhite==0 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     5,666
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0531075{col 26}{space 2} .0173209{col 37}{space 1}    3.07{col 46}{space 3}0.002{col 54}{space 4} .0191591{col 67}{space 3} .0870559
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0537098{col 26}{space 2} .0166769{col 37}{space 1}    3.22{col 46}{space 3}0.001{col 54}{space 4} .0210236{col 67}{space 3} .0863959
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0001978{col 26}{space 2} .0025655{col 37}{space 1}   -0.08{col 46}{space 3}0.939{col 54}{space 4}-.0052262{col 67}{space 3} .0048305
{txt}ereri_intmed {c |}{col 14}{res}{space 2} -.000013{col 26}{space 2} .0001288{col 37}{space 1}   -0.10{col 46}{space 3}0.920{col 54}{space 4}-.0002655{col 67}{space 3} .0002395
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0003914{col 26}{space 2}  .003832{col 37}{space 1}   -0.10{col 46}{space 3}0.919{col 54}{space 4}-.0079019{col 67}{space 3} .0071191
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     5,666
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0457691{col 26}{space 2} .0174178{col 37}{space 1}    2.63{col 46}{space 3}0.009{col 54}{space 4} .0116309{col 67}{space 3} .0799074
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0467597{col 26}{space 2} .0162727{col 37}{space 1}    2.87{col 46}{space 3}0.004{col 54}{space 4} .0148659{col 67}{space 3} .0786535
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0094767{col 26}{space 2}  .003652{col 37}{space 1}   -2.59{col 46}{space 3}0.009{col 54}{space 4}-.0166345{col 67}{space 3}-.0023189
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0005484{col 26}{space 2} .0004714{col 37}{space 1}   -1.16{col 46}{space 3}0.245{col 54}{space 4}-.0014724{col 67}{space 3} .0003755
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0090346{col 26}{space 2} .0054676{col 37}{space 1}    1.65{col 46}{space 3}0.098{col 54}{space 4}-.0016818{col 67}{space 3}  .019751
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     5,666
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0433504{col 26}{space 2} .0172777{col 37}{space 1}    2.51{col 46}{space 3}0.012{col 54}{space 4} .0094867{col 67}{space 3} .0772141
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0519718{col 26}{space 2} .0162453{col 37}{space 1}    3.20{col 46}{space 3}0.001{col 54}{space 4} .0201316{col 67}{space 3} .0838119
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0093252{col 26}{space 2}  .003673{col 37}{space 1}   -2.54{col 46}{space 3}0.011{col 54}{space 4}-.0165241{col 67}{space 3}-.0021263
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0000446{col 26}{space 2} .0003134{col 37}{space 1}   -0.14{col 46}{space 3}0.887{col 54}{space 4}-.0006588{col 67}{space 3} .0005696
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0007484{col 26}{space 2}  .005234{col 37}{space 1}    0.14{col 46}{space 3}0.886{col 54}{space 4}-.0095101{col 67}{space 3}  .011007
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. 
. *****SENSITIVITY ANALYSIS,  NHW*******
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way zpoorsleepalt_2006 `m' AGE2006 SEX NonWhite if NonWhite==0 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     5,666
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0426146{col 26}{space 2} .0172485{col 37}{space 1}    2.47{col 46}{space 3}0.013{col 54}{space 4} .0088081{col 67}{space 3} .0764211
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0455927{col 26}{space 2}  .016644{col 37}{space 1}    2.74{col 46}{space 3}0.006{col 54}{space 4} .0129709{col 67}{space 3} .0782144
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0006782{col 26}{space 2}   .00257{col 37}{space 1}   -0.26{col 46}{space 3}0.792{col 54}{space 4}-.0057153{col 67}{space 3} .0043589
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0000424{col 26}{space 2} .0001336{col 37}{space 1}   -0.32{col 46}{space 3}0.751{col 54}{space 4}-.0003042{col 67}{space 3} .0002194
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0022575{col 26}{space 2} .0038237{col 37}{space 1}   -0.59{col 46}{space 3}0.555{col 54}{space 4}-.0097518{col 67}{space 3} .0052368
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     5,666
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0354843{col 26}{space 2} .0173161{col 37}{space 1}    2.05{col 46}{space 3}0.040{col 54}{space 4} .0015454{col 67}{space 3} .0694232
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0383222{col 26}{space 2} .0162255{col 37}{space 1}    2.36{col 46}{space 3}0.018{col 54}{space 4} .0065208{col 67}{space 3} .0701235
{txt}ereri_intref {c |}{col 14}{res}{space 2} -.010111{col 26}{space 2}   .00365{col 37}{space 1}   -2.77{col 46}{space 3}0.006{col 54}{space 4}-.0172648{col 67}{space 3}-.0029571
{txt}ereri_intmed {c |}{col 14}{res}{space 2} -.000566{col 26}{space 2} .0004904{col 37}{space 1}   -1.15{col 46}{space 3}0.248{col 54}{space 4}-.0015273{col 67}{space 3} .0003952
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0078392{col 26}{space 2} .0054609{col 37}{space 1}    1.44{col 46}{space 3}0.151{col 54}{space 4}-.0028639{col 67}{space 3} .0185423
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     5,666
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0328911{col 26}{space 2} .0171847{col 37}{space 1}    1.91{col 46}{space 3}0.056{col 54}{space 4}-.0007903{col 67}{space 3} .0665726
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}  .043853{col 26}{space 2} .0162077{col 37}{space 1}    2.71{col 46}{space 3}0.007{col 54}{space 4} .0120866{col 67}{space 3} .0756194
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0100874{col 26}{space 2}  .003663{col 37}{space 1}   -2.75{col 46}{space 3}0.006{col 54}{space 4}-.0172667{col 67}{space 3}-.0029082
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0000682{col 26}{space 2} .0003795{col 37}{space 1}    0.18{col 46}{space 3}0.857{col 54}{space 4}-.0006756{col 67}{space 3} .0008121
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0009427{col 26}{space 2} .0052236{col 37}{space 1}   -0.18{col 46}{space 3}0.857{col 54}{space 4}-.0111808{col 67}{space 3} .0092954
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. ***************************Non-White*************************************
. capture drop zpoorsleep_2006 
{txt}
{com}. capture drop zpoorsleepalt_2006
{txt}
{com}. capture drop zlnhurd_odds 
{txt}
{com}. capture drop zlnexpert_odds 
{txt}
{com}. capture drop zlnlasso_odds
{txt}
{com}. foreach x of varlist poorsleep_2006 poorsleepalt_2006 lnhurd_odds lnexpert_odds lnlasso_odds {c -(}
{txt}  2{com}.         mi passive: egen z`x'=std(`x') if sample_final==1
{txt}  3{com}. {c )-}
{res}{txt}{p}
(passive variables
{res}zpoorsleep_2006 zpoorsleepalt_2006 zlnhurd_odds zlnexpert_odds zlnlasso_odds
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. 
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way zpoorsleep_2006 `m' AGE2006 SEX NonWhite if NonWhite==1 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     1,325
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}  -.00793{col 26}{space 2}  .033866{col 37}{space 1}   -0.23{col 46}{space 3}0.815{col 54}{space 4} -.074306{col 67}{space 3} .0584461
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0246619{col 26}{space 2} .0310683{col 37}{space 1}   -0.79{col 46}{space 3}0.427{col 54}{space 4}-.0855546{col 67}{space 3} .0362308
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0038815{col 26}{space 2} .0113912{col 37}{space 1}   -0.34{col 46}{space 3}0.733{col 54}{space 4}-.0262079{col 67}{space 3} .0184449
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0006773{col 26}{space 2} .0017507{col 37}{space 1}   -0.39{col 46}{space 3}0.699{col 54}{space 4}-.0041087{col 67}{space 3} .0027541
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0212907{col 26}{space 2} .0078477{col 37}{space 1}    2.71{col 46}{space 3}0.007{col 54}{space 4} .0059095{col 67}{space 3} .0366719
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     1,325
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0193901{col 26}{space 2} .0342508{col 37}{space 1}   -0.57{col 46}{space 3}0.571{col 54}{space 4}-.0865204{col 67}{space 3} .0477401
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} -.026851{col 26}{space 2} .0315244{col 37}{space 1}   -0.85{col 46}{space 3}0.394{col 54}{space 4}-.0886377{col 67}{space 3} .0349357
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0289869{col 26}{space 2} .0172197{col 37}{space 1}   -1.68{col 46}{space 3}0.092{col 54}{space 4}-.0627369{col 67}{space 3} .0047631
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0068756{col 26}{space 2} .0042625{col 37}{space 1}   -1.61{col 46}{space 3}0.107{col 54}{space 4}-.0152299{col 67}{space 3} .0014788
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0433233{col 26}{space 2} .0107849{col 37}{space 1}    4.02{col 46}{space 3}0.000{col 54}{space 4} .0221853{col 67}{space 3} .0644613
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     1,325
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0130035{col 26}{space 2}  .034592{col 37}{space 1}   -0.38{col 46}{space 3}0.707{col 54}{space 4}-.0808026{col 67}{space 3} .0547955
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0289132{col 26}{space 2}  .030435{col 37}{space 1}   -0.95{col 46}{space 3}0.342{col 54}{space 4}-.0885647{col 67}{space 3} .0307383
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0161982{col 26}{space 2} .0163424{col 37}{space 1}   -0.99{col 46}{space 3}0.322{col 54}{space 4}-.0482287{col 67}{space 3} .0158323
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0031271{col 26}{space 2} .0031029{col 37}{space 1}   -1.01{col 46}{space 3}0.314{col 54}{space 4}-.0092086{col 67}{space 3} .0029544
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}  .035235{col 26}{space 2} .0106112{col 37}{space 1}    3.32{col 46}{space 3}0.001{col 54}{space 4} .0144374{col 67}{space 3} .0560326
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. *****SENSITIVITY ANALYSIS,  Non-White*******
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way zpoorsleepalt_2006 `m' AGE2006 SEX NonWhite if NonWhite==1 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     1,325
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0163719{col 26}{space 2} .0330191{col 37}{space 1}   -0.50{col 46}{space 3}0.620{col 54}{space 4} -.081088{col 67}{space 3} .0483443
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0301902{col 26}{space 2} .0304454{col 37}{space 1}   -0.99{col 46}{space 3}0.321{col 54}{space 4}-.0898622{col 67}{space 3} .0294817
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0018161{col 26}{space 2} .0118397{col 37}{space 1}   -0.15{col 46}{space 3}0.878{col 54}{space 4}-.0250214{col 67}{space 3} .0213893
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0002873{col 26}{space 2}  .001341{col 37}{space 1}   -0.21{col 46}{space 3}0.830{col 54}{space 4}-.0029156{col 67}{space 3}  .002341
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0159217{col 26}{space 2} .0076197{col 37}{space 1}    2.09{col 46}{space 3}0.037{col 54}{space 4} .0009873{col 67}{space 3} .0308562
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     1,325
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}  -.02867{col 26}{space 2} .0332467{col 37}{space 1}   -0.86{col 46}{space 3}0.388{col 54}{space 4}-.0938324{col 67}{space 3} .0364924
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0298297{col 26}{space 2} .0309181{col 37}{space 1}   -0.96{col 46}{space 3}0.335{col 54}{space 4}-.0904281{col 67}{space 3} .0307687
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0320221{col 26}{space 2}  .016716{col 37}{space 1}   -1.92{col 46}{space 3}0.055{col 54}{space 4}-.0647848{col 67}{space 3} .0007406
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0070443{col 26}{space 2} .0039502{col 37}{space 1}   -1.78{col 46}{space 3}0.075{col 54}{space 4}-.0147865{col 67}{space 3}  .000698
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}  .040226{col 26}{space 2} .0105283{col 37}{space 1}    3.82{col 46}{space 3}0.000{col 54}{space 4}  .019591{col 67}{space 3} .0608611
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     1,325
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0230341{col 26}{space 2}  .033538{col 37}{space 1}   -0.69{col 46}{space 3}0.492{col 54}{space 4}-.0887673{col 67}{space 3} .0426991
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0316987{col 26}{space 2} .0298515{col 37}{space 1}   -1.06{col 46}{space 3}0.288{col 54}{space 4}-.0902066{col 67}{space 3} .0268092
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0188888{col 26}{space 2} .0158752{col 37}{space 1}   -1.19{col 46}{space 3}0.234{col 54}{space 4}-.0500037{col 67}{space 3} .0122261
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0031746{col 26}{space 2} .0027188{col 37}{space 1}   -1.17{col 46}{space 3}0.243{col 54}{space 4}-.0085033{col 67}{space 3} .0021542
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0307279{col 26}{space 2} .0103161{col 37}{space 1}    2.98{col 46}{space 3}0.003{col 54}{space 4} .0105087{col 67}{space 3} .0509471
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save finaldata_imputed_FINAL, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_FINAL.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}