{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. **STEP 17: TABLE 3: MED4WAY FOR POOR SLEEP AS EXPOSURE, DIFFERENT PROBABILITIES OF DEMENTIA AS MEDIATORS, AND ALL-CAUSE DEATH AS OUTCOME: FULL MODEL; OVERALL AND STRATIFIED BY SEX AND BY RACE/ETHNICITY***
. 
. **COVARIATES: NonWhite AGE2006 SEX  i.education  i.totwealth_2006 marital_2006 work_st_2006 i.smoking_2006 physic_act_2006 i.srh_2006  i.bmibr_2006 cardiometcondbr_2006
. 
. use finaldata_imputed_FINAL,clear
{txt}
{com}. 
. 
. 
. capture drop lnhurd_odds
{txt}
{com}. mi passive: gen lnhurd_odds=ln((hurd_p)/(1-hurd_p))
{res}{txt}{it:m}=0:
(35,952 missing values generated)
{it:m}=1:
(35,952 missing values generated)
{it:m}=2:
(35,952 missing values generated)
{it:m}=3:
(35,952 missing values generated)
{it:m}=4:
(35,952 missing values generated)
{it:m}=5:
(35,952 missing values generated)

{com}. 
. capture drop lnexpert_odds
{txt}
{com}. mi passive: gen lnexpert_odds=ln((expert_p)/(1-expert_p))
{res}{txt}{it:m}=0:
(35,850 missing values generated)
{it:m}=1:
(35,850 missing values generated)
{it:m}=2:
(35,850 missing values generated)
{it:m}=3:
(35,850 missing values generated)
{it:m}=4:
(35,850 missing values generated)
{it:m}=5:
(35,850 missing values generated)

{com}. 
. 
. capture drop lnlasso_odds
{txt}
{com}. mi passive: gen lnlasso_odds=ln((lasso_p)/(1-lasso_p))
{res}{txt}{it:m}=0:
(36,394 missing values generated)
{it:m}=1:
(36,394 missing values generated)
{it:m}=2:
(36,394 missing values generated)
{it:m}=3:
(36,394 missing values generated)
{it:m}=4:
(36,394 missing values generated)
{it:m}=5:
(36,394 missing values generated)

{com}. 
. 
. capture drop Men
{txt}
{com}. mi passive: gen Men=1 if SEX==1 & sample_final==1
{res}{txt}{it:m}=0:
(40,630 missing values generated)
{it:m}=1:
(40,630 missing values generated)
{it:m}=2:
(40,630 missing values generated)
{it:m}=3:
(40,630 missing values generated)
{it:m}=4:
(40,630 missing values generated)
{it:m}=5:
(40,630 missing values generated)

{com}. mi passive: replace Men=0 if Men~=1 & SEX~=. & sample_final==1
{res}{txt}{it:m}=0:
(4,060 real changes made)
{it:m}=1:
(4,060 real changes made)
{it:m}=2:
(4,060 real changes made)
{it:m}=3:
(4,060 real changes made)
{it:m}=4:
(4,060 real changes made)
{it:m}=5:
(4,060 real changes made)

{com}. 
. capture drop Women
{txt}
{com}. mi passive: gen Women=1 if SEX==2 & sample_final==1
{res}{txt}{it:m}=0:
(39,501 missing values generated)
{it:m}=1:
(39,501 missing values generated)
{it:m}=2:
(39,501 missing values generated)
{it:m}=3:
(39,501 missing values generated)
{it:m}=4:
(39,501 missing values generated)
{it:m}=5:
(39,501 missing values generated)

{com}. mi passive: replace Women=0 if Women~=1 & SEX~=. & sample_final==1
{res}{txt}{it:m}=0:
(2,931 real changes made)
{it:m}=1:
(2,931 real changes made)
{it:m}=2:
(2,931 real changes made)
{it:m}=3:
(2,931 real changes made)
{it:m}=4:
(2,931 real changes made)
{it:m}=5:
(2,931 real changes made)

{com}. 
. capture drop NHW
{txt}
{com}. mi passive: gen NHW=1 if RACE_ETHN==1 & sample_final==1
{res}{txt}{it:m}=0:
(37,895 missing values generated)
{it:m}=1:
(37,895 missing values generated)
{it:m}=2:
(37,895 missing values generated)
{it:m}=3:
(37,895 missing values generated)
{it:m}=4:
(37,895 missing values generated)
{it:m}=5:
(37,895 missing values generated)

{com}. mi passive: replace NHW=0 if NHW~=1 & RACE_ETHN~=. & sample_final==1
{res}{txt}{it:m}=0:
(1,325 real changes made)
{it:m}=1:
(1,325 real changes made)
{it:m}=2:
(1,325 real changes made)
{it:m}=3:
(1,325 real changes made)
{it:m}=4:
(1,325 real changes made)
{it:m}=5:
(1,325 real changes made)

{com}. 
. capture drop NHB
{txt}
{com}. mi passive: gen NHB=1 if RACE_ETHN==2 & sample_final==1
{res}{txt}{it:m}=0:
(42,705 missing values generated)
{it:m}=1:
(42,705 missing values generated)
{it:m}=2:
(42,705 missing values generated)
{it:m}=3:
(42,705 missing values generated)
{it:m}=4:
(42,705 missing values generated)
{it:m}=5:
(42,705 missing values generated)

{com}. mi passive: replace NHB=0 if NHB~=1 & RACE_ETHN~=. & sample_final==1
{res}{txt}{it:m}=0:
(6,135 real changes made)
{it:m}=1:
(6,135 real changes made)
{it:m}=2:
(6,135 real changes made)
{it:m}=3:
(6,135 real changes made)
{it:m}=4:
(6,135 real changes made)
{it:m}=5:
(6,135 real changes made)

{com}. 
. 
. capture drop HISP
{txt}
{com}. mi passive: gen HISP=1 if RACE_ETHN==3 & sample_final==1
{res}{txt}{it:m}=0:
(43,092 missing values generated)
{it:m}=1:
(43,092 missing values generated)
{it:m}=2:
(43,092 missing values generated)
{it:m}=3:
(43,092 missing values generated)
{it:m}=4:
(43,092 missing values generated)
{it:m}=5:
(43,092 missing values generated)

{com}. mi passive: replace HISP=0 if HISP~=1 & RACE_ETHN~=. & sample_final==1 
{res}{txt}{it:m}=0:
(6,522 real changes made)
{it:m}=1:
(6,522 real changes made)
{it:m}=2:
(6,522 real changes made)
{it:m}=3:
(6,522 real changes made)
{it:m}=4:
(6,522 real changes made)
{it:m}=5:
(6,522 real changes made)

{com}. 
. 
. capture drop OTHER
{txt}
{com}. mi passive: gen OTHER=1 if RACE_ETHN==4 & sample_final==1
{res}{txt}{it:m}=0:
(43,561 missing values generated)
{it:m}=1:
(43,561 missing values generated)
{it:m}=2:
(43,561 missing values generated)
{it:m}=3:
(43,561 missing values generated)
{it:m}=4:
(43,561 missing values generated)
{it:m}=5:
(43,561 missing values generated)

{com}. mi passive: replace OTHER=0 if OTHER~=1 & RACE_ETHN~=. & sample_final==1
{res}{txt}{it:m}=0:
(6,991 real changes made)
{it:m}=1:
(6,991 real changes made)
{it:m}=2:
(6,991 real changes made)
{it:m}=3:
(6,991 real changes made)
{it:m}=4:
(6,991 real changes made)
{it:m}=5:
(6,991 real changes made)

{com}. 
. 
. capture drop NonWhite
{txt}
{com}. mi passive: gen NonWhite=0 if RACE_ETHN==1 & sample_final==1
{res}{txt}{p}
(passive variable
{res}NonWhite
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(37,895 missing values generated)
{it:m}=1:
(37,895 missing values generated)
{it:m}=2:
(37,895 missing values generated)
{it:m}=3:
(37,895 missing values generated)
{it:m}=4:
(37,895 missing values generated)
{it:m}=5:
(37,895 missing values generated)

{com}. mi passive: replace NonWhite=1 if RACE_ETHN!=1 & RACE_ETHN!=. & sample_final==1
{res}{txt}{it:m}=0:
(1,325 real changes made)
{it:m}=1:
(1,325 real changes made)
{it:m}=2:
(1,325 real changes made)
{it:m}=3:
(1,325 real changes made)
{it:m}=4:
(1,325 real changes made)
{it:m}=5:
(1,325 real changes made)

{com}. 
. save, replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. capture mi stset ageevent [pweight = kwgtr] if sample_final==1, failure(died==1) enter(AGE2006) origin(AGE2006) id(HHIDPN) scale(1)
{txt}
{com}. 
. capture drop educationg* totalwealth_2006g* marital_2006g* smoking_2006g* physic_act_2006g* srh_2006g* bmibr_2006g*  cardiometcondbr_2006g*
{txt}
{com}. 
. tab education,generate(educationg)

  {txt}education {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     64,385       25.42       25.42
{txt}          2 {c |}{res}     12,398        4.89       30.32
{txt}          3 {c |}{res}     71,253       28.13       58.45
{txt}          4 {c |}{res}     56,752       22.41       80.85
{txt}          5 {c |}{res}     48,493       19.15      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    253,281      100.00
{txt}
{com}. 
. tab totwealth_2006, generate(totalwealth_2006g)

{txt}totwealth_2 {c |}
        006 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     38,448       34.70       34.70
{txt}          2 {c |}{res}     60,978       55.03       89.72
{txt}          3 {c |}{res}      9,396        8.48       98.20
{txt}          4 {c |}{res}      1,554        1.40       99.60
{txt}          5 {c |}{res}        438        0.40      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    110,814      100.00
{txt}
{com}. 
. tab marital_2006, generate(marital_2006g)

{txt}marital_200 {c |}
          6 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      3,277        2.96        2.96
{txt}          2 {c |}{res}     72,317       65.26       68.22
{txt}          3 {c |}{res}     12,157       10.97       79.19
{txt}          4 {c |}{res}     23,061       20.81      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    110,812      100.00
{txt}
{com}. 
. tab smoking_2006, generate(smoking_2006g)

{txt}smoking_200 {c |}
          6 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     47,368       42.89       42.89
{txt}          2 {c |}{res}     47,821       43.30       86.19
{txt}          3 {c |}{res}     15,250       13.81      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    110,439      100.00
{txt}
{com}. 
. tab physic_act_2006, generate(physic_act_2006g)

{txt}physic_act_ {c |}
       2006 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     24,705       22.30       22.30
{txt}          2 {c |}{res}     22,890       20.66       42.96
{txt}          3 {c |}{res}     63,187       57.04      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    110,782      100.00
{txt}
{com}. 
. tab srh_2006, generate(srh_2006g)

   {txt}srh_2006 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     77,555       70.01       70.01
{txt}          2 {c |}{res}     33,219       29.99      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    110,774      100.00
{txt}
{com}. 
. tab bmibr_2006, generate(bmibr_2006g)

 {txt}bmibr_2006 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     35,584       32.25       32.25
{txt}          2 {c |}{res}     41,644       37.74       69.99
{txt}          3 {c |}{res}     33,113       30.01      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    110,341      100.00
{txt}
{com}.  
. tab cardiometcondbr_2006, generate(cardiometcondbr_2006g)

{txt}cardiometco {c |}
  ndbr_2006 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     37,632       33.96       33.96
{txt}          2 {c |}{res}     63,186       57.02       90.98
{txt}          3 {c |}{res}      9,996        9.02      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    110,814      100.00
{txt}
{com}. 
. 
. 
. ***************************TABLE 4: MODEL 2*********************************
. 
. *****************************OVERALL*******************************
. capture drop zpoorsleep_2006 
{txt}
{com}. capture drop zpoorsleepalt_2006
{txt}
{com}. capture drop zlnhurd_odds 
{txt}
{com}. capture drop zlnexpert_odds 
{txt}
{com}. capture drop zlnlasso_odds
{txt}
{com}. foreach x of varlist poorsleep_2006 poorsleepalt_2006 lnhurd_odds lnexpert_odds lnlasso_odds {c -(}
{txt}  2{com}.         mi passive: egen z`x'=std(`x') if sample_final==1
{txt}  3{com}. {c )-}
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. 
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way zpoorsleep_2006 `m' AGE2006 SEX NonWhite  educationg* totwealth_2006 marital_2006g* smoking_2006g* physic_act_2006g* srh_2006g* bmibr_2006g*  cardiometcondbr_2006g* zcesd_2006 if sample_final==1 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}variable {bf}zcesd_2006{sf} not found
{res}{err}{p 0}
an error occurred when {bf:mi} {bf:estimate} executed 
{bf:med4way}{err} on {it:m}=1
{p_end}
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "C:\Users\baydounm\AppData\Local\Temp\STD6434_000000.tmp"
{txt}
{com}. 
. mi passive: egen zcesd_2006=std(cesd_2006) if sample_final==1
{res}{txt}{it:m}=0:
(37,051 missing values generated)
{it:m}=1:
(37,051 missing values generated)
{it:m}=2:
(37,051 missing values generated)
{it:m}=3:
(37,051 missing values generated)
{it:m}=4:
(37,051 missing values generated)
{it:m}=5:
(37,051 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. 
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way zpoorsleep_2006 `m' AGE2006 SEX NonWhite  educationg* totwealth_2006 marital_2006g* smoking_2006g* physic_act_2006g* srh_2006g* bmibr_2006g*  cardiometcondbr_2006g* zcesd_2006 if sample_final==1 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}{p}
type mismatch:
exp.exp:
transmorphic
found where
struct
expected
{p_end}
{txt}{search r(3000), local:r(3000);}

end of do-file

{search r(3000), local:r(3000);}

{com}. do "C:\Users\baydounm\AppData\Local\Temp\STD6434_000000.tmp"
{txt}
{com}. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way zpoorsleep_2006 `m' AGE2006 SEX NonWhite  educationg* totwealth_2006 marital_2006g* smoking_2006g* physic_act_2006g* srh_2006g* bmibr_2006g*  cardiometcondbr_2006g* zcesd_2006 if sample_final==1 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     6,510
{txt}{col 49}Average RVI{col 67}= {res}    0.0001
{txt}{col 49}Largest FMI{col 67}= {res}    0.0001
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  3.23e+08
{txt}{col 49}        avg{col 67}= {res}  7.60e+09
{txt}{col 49}        max{col 67}= {res}  2.57e+10

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0653792{col 26}{space 2} .0161437{col 37}{space 1}   -4.05{col 46}{space 3}0.000{col 54}{space 4}-.0970203{col 67}{space 3}-.0337381
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0639995{col 26}{space 2} .0164227{col 37}{space 1}   -3.90{col 46}{space 3}0.000{col 54}{space 4}-.0961873{col 67}{space 3}-.0318116
{txt}ereri_intref {c |}{col 14}{res}{space 2} .0055301{col 26}{space 2} .0017506{col 37}{space 1}    3.16{col 46}{space 3}0.002{col 54}{space 4}  .002099{col 67}{space 3} .0089611
{txt}ereri_intmed {c |}{col 14}{res}{space 2}  .003625{col 26}{space 2} .0011361{col 37}{space 1}    3.19{col 46}{space 3}0.001{col 54}{space 4} .0013982{col 67}{space 3} .0058517
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0105348{col 26}{space 2} .0029528{col 37}{space 1}   -3.57{col 46}{space 3}0.000{col 54}{space 4}-.0163221{col 67}{space 3}-.0047474
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     6,510
{txt}{col 49}Average RVI{col 67}= {res}    0.0001
{txt}{col 49}Largest FMI{col 67}= {res}    0.0002
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1.14e+08
{txt}{col 49}        avg{col 67}= {res}  3.84e+09
{txt}{col 49}        max{col 67}= {res}  9.28e+09

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0667337{col 26}{space 2} .0161466{col 37}{space 1}   -4.13{col 46}{space 3}0.000{col 54}{space 4}-.0983804{col 67}{space 3}-.0350869
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0589408{col 26}{space 2} .0163506{col 37}{space 1}   -3.60{col 46}{space 3}0.000{col 54}{space 4}-.0909873{col 67}{space 3}-.0268942
{txt}ereri_intref {c |}{col 14}{res}{space 2} .0007869{col 26}{space 2} .0012523{col 37}{space 1}    0.63{col 46}{space 3}0.530{col 54}{space 4}-.0016675{col 67}{space 3} .0032413
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0039057{col 26}{space 2} .0011079{col 37}{space 1}    3.53{col 46}{space 3}0.000{col 54}{space 4} .0017344{col 67}{space 3} .0060771
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0124855{col 26}{space 2}  .003035{col 37}{space 1}   -4.11{col 46}{space 3}0.000{col 54}{space 4}-.0184339{col 67}{space 3}-.0065371
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     6,510
{txt}{col 49}Average RVI{col 67}= {res}    0.0001
{txt}{col 49}Largest FMI{col 67}= {res}    0.0002
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1.60e+08
{txt}{col 49}        avg{col 67}= {res}  4.82e+09
{txt}{col 49}        max{col 67}= {res}  6.96e+09

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0684043{col 26}{space 2} .0160811{col 37}{space 1}   -4.25{col 46}{space 3}0.000{col 54}{space 4}-.0999227{col 67}{space 3}-.0368859
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0595854{col 26}{space 2} .0164094{col 37}{space 1}   -3.63{col 46}{space 3}0.000{col 54}{space 4}-.0917473{col 67}{space 3}-.0274235
{txt}ereri_intref {c |}{col 14}{res}{space 2} .0022245{col 26}{space 2} .0013284{col 37}{space 1}    1.67{col 46}{space 3}0.094{col 54}{space 4}-.0003792{col 67}{space 3} .0048282
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0044225{col 26}{space 2} .0011574{col 37}{space 1}    3.82{col 46}{space 3}0.000{col 54}{space 4} .0021541{col 67}{space 3} .0066908
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0154659{col 26}{space 2} .0032987{col 37}{space 1}   -4.69{col 46}{space 3}0.000{col 54}{space 4}-.0219312{col 67}{space 3}-.0090006
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. *****SENSITIVITY ANALYSIS, OVERALL*******
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way zpoorsleepalt_2006 `m' AGE2006 SEX NonWhite  educationg* totwealth_2006 marital_2006g* smoking_2006g* physic_act_2006g* srh_2006g* bmibr_2006g*  cardiometcondbr_2006g* zcesd_2006 if sample_final==1 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     6,510
{txt}{col 49}Average RVI{col 67}= {res}    0.0001
{txt}{col 49}Largest FMI{col 67}= {res}    0.0001
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  3.59e+08
{txt}{col 49}        avg{col 67}= {res}  1.24e+10
{txt}{col 49}        max{col 67}= {res}  3.23e+10

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0713071{col 26}{space 2} .0159959{col 37}{space 1}   -4.46{col 46}{space 3}0.000{col 54}{space 4}-.1026585{col 67}{space 3}-.0399556
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0696972{col 26}{space 2} .0162731{col 37}{space 1}   -4.28{col 46}{space 3}0.000{col 54}{space 4}-.1015919{col 67}{space 3}-.0378025
{txt}ereri_intref {c |}{col 14}{res}{space 2} .0056935{col 26}{space 2} .0017507{col 37}{space 1}    3.25{col 46}{space 3}0.001{col 54}{space 4} .0022622{col 67}{space 3} .0091248
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0039003{col 26}{space 2} .0011567{col 37}{space 1}    3.37{col 46}{space 3}0.001{col 54}{space 4} .0016332{col 67}{space 3} .0061674
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0112037{col 26}{space 2} .0029377{col 37}{space 1}   -3.81{col 46}{space 3}0.000{col 54}{space 4}-.0169615{col 67}{space 3}-.0054459
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     6,510
{txt}{col 49}Average RVI{col 67}= {res}    0.0001
{txt}{col 49}Largest FMI{col 67}= {res}    0.0002
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1.16e+08
{txt}{col 49}        avg{col 67}= {res}  6.21e+09
{txt}{col 49}        max{col 67}= {res}  1.34e+10

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0724546{col 26}{space 2} .0160052{col 37}{space 1}   -4.53{col 46}{space 3}0.000{col 54}{space 4}-.1038243{col 67}{space 3}-.0410849
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0650126{col 26}{space 2} .0161977{col 37}{space 1}   -4.01{col 46}{space 3}0.000{col 54}{space 4}-.0967596{col 67}{space 3}-.0332657
{txt}ereri_intref {c |}{col 14}{res}{space 2} .0008955{col 26}{space 2} .0012469{col 37}{space 1}    0.72{col 46}{space 3}0.473{col 54}{space 4}-.0015484{col 67}{space 3} .0033395
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0038437{col 26}{space 2} .0010987{col 37}{space 1}    3.50{col 46}{space 3}0.000{col 54}{space 4} .0016903{col 67}{space 3}  .005997
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0121812{col 26}{space 2} .0030042{col 37}{space 1}   -4.05{col 46}{space 3}0.000{col 54}{space 4}-.0180693{col 67}{space 3}-.0062931
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     6,510
{txt}{col 49}Average RVI{col 67}= {res}    0.0001
{txt}{col 49}Largest FMI{col 67}= {res}    0.0002
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1.75e+08
{txt}{col 49}        avg{col 67}= {res}  1.03e+10
{txt}{col 49}        max{col 67}= {res}  1.99e+10

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0744681{col 26}{space 2} .0159327{col 37}{space 1}   -4.67{col 46}{space 3}0.000{col 54}{space 4}-.1056957{col 67}{space 3}-.0432405
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0656908{col 26}{space 2} .0162566{col 37}{space 1}   -4.04{col 46}{space 3}0.000{col 54}{space 4}-.0975532{col 67}{space 3}-.0338285
{txt}ereri_intref {c |}{col 14}{res}{space 2} .0023859{col 26}{space 2} .0013247{col 37}{space 1}    1.80{col 46}{space 3}0.072{col 54}{space 4}-.0002105{col 67}{space 3} .0049824
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0045361{col 26}{space 2} .0011665{col 37}{space 1}    3.89{col 46}{space 3}0.000{col 54}{space 4} .0022497{col 67}{space 3} .0068225
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0156992{col 26}{space 2} .0032712{col 37}{space 1}   -4.80{col 46}{space 3}0.000{col 54}{space 4}-.0221107{col 67}{space 3}-.0092878
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. *****************************MEN*******************************
. capture drop zpoorsleep_2006 
{txt}
{com}. capture drop zpoorsleepalt_2006
{txt}
{com}. capture drop zlnhurd_odds 
{txt}
{com}. capture drop zlnexpert_odds 
{txt}
{com}. capture drop zlnlasso_odds
{txt}
{com}. foreach x of varlist poorsleep_2006 poorsleepalt_2006 lnhurd_odds lnexpert_odds lnlasso_odds {c -(}
{txt}  2{com}.         mi passive: egen z`x'=std(`x') if sample_final==1
{txt}  3{com}. {c )-}
{res}{txt}{p}
(passive variables
{res}zpoorsleep_2006 zpoorsleepalt_2006 zlnhurd_odds zlnexpert_odds zlnlasso_odds
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. 
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way zpoorsleep_2006 `m' AGE2006 SEX NonWhite  educationg* totwealth_2006 marital_2006g* smoking_2006g* physic_act_2006g* srh_2006g* bmibr_2006g*  cardiometcondbr_2006g* zcesd_2006 if SEX==1 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     2,698
{txt}{col 49}Average RVI{col 67}= {res}    0.0001
{txt}{col 49}Largest FMI{col 67}= {res}    0.0003
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  4.11e+07
{txt}{col 49}        avg{col 67}= {res}  1.33e+09
{txt}{col 49}        max{col 67}= {res}  5.09e+09

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0464783{col 26}{space 2} .0255186{col 37}{space 1}   -1.82{col 46}{space 3}0.069{col 54}{space 4}-.0964939{col 67}{space 3} .0035373
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0509472{col 26}{space 2} .0257284{col 37}{space 1}   -1.98{col 46}{space 3}0.048{col 54}{space 4}-.1013739{col 67}{space 3}-.0005205
{txt}ereri_intref {c |}{col 14}{res}{space 2} .0072059{col 26}{space 2} .0030444{col 37}{space 1}    2.37{col 46}{space 3}0.018{col 54}{space 4}  .001239{col 67}{space 3} .0131728
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0017317{col 26}{space 2}  .001408{col 37}{space 1}    1.23{col 46}{space 3}0.219{col 54}{space 4}-.0010279{col 67}{space 3} .0044913
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0044688{col 26}{space 2} .0034806{col 37}{space 1}   -1.28{col 46}{space 3}0.199{col 54}{space 4}-.0112906{col 67}{space 3} .0023531
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     2,698
{txt}{col 49}Average RVI{col 67}= {res}    0.0001
{txt}{col 49}Largest FMI{col 67}= {res}    0.0005
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1.76e+07
{txt}{col 49}        avg{col 67}= {res}  4.58e+08
{txt}{col 49}        max{col 67}= {res}  9.82e+08

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0462402{col 26}{space 2} .0255883{col 37}{space 1}   -1.81{col 46}{space 3}0.071{col 54}{space 4}-.0963924{col 67}{space 3}  .003912
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0475651{col 26}{space 2} .0257412{col 37}{space 1}   -1.85{col 46}{space 3}0.065{col 54}{space 4}-.0980169{col 67}{space 3} .0028866
{txt}ereri_intref {c |}{col 14}{res}{space 2}  .005353{col 26}{space 2} .0025776{col 37}{space 1}    2.08{col 46}{space 3}0.038{col 54}{space 4} .0003009{col 67}{space 3} .0104051
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0021476{col 26}{space 2} .0012907{col 37}{space 1}    1.66{col 46}{space 3}0.096{col 54}{space 4}-.0003821{col 67}{space 3} .0046774
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0061757{col 26}{space 2} .0032259{col 37}{space 1}   -1.91{col 46}{space 3}0.056{col 54}{space 4}-.0124984{col 67}{space 3} .0001469
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     2,698
{txt}{col 49}Average RVI{col 67}= {res}    0.0001
{txt}{col 49}Largest FMI{col 67}= {res}    0.0004
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  2.74e+07
{txt}{col 49}        avg{col 67}= {res}  5.31e+08
{txt}{col 49}        max{col 67}= {res}  9.60e+08

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0482747{col 26}{space 2} .0254657{col 37}{space 1}   -1.90{col 46}{space 3}0.058{col 54}{space 4}-.0981865{col 67}{space 3} .0016372
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0529877{col 26}{space 2} .0263232{col 37}{space 1}   -2.01{col 46}{space 3}0.044{col 54}{space 4}-.1045801{col 67}{space 3}-.0013952
{txt}ereri_intref {c |}{col 14}{res}{space 2} .0105406{col 26}{space 2}  .004262{col 37}{space 1}    2.47{col 46}{space 3}0.013{col 54}{space 4} .0021873{col 67}{space 3} .0188939
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0020366{col 26}{space 2}  .001237{col 37}{space 1}    1.65{col 46}{space 3}0.100{col 54}{space 4}-.0003879{col 67}{space 3} .0044612
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0078643{col 26}{space 2} .0039785{col 37}{space 1}   -1.98{col 46}{space 3}0.048{col 54}{space 4}-.0156619{col 67}{space 3}-.0000666
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. *****SENSITIVITY ANALYSIS, MEN*******
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way zpoorsleepalt_2006 `m' AGE2006 SEX NonWhite  educationg* totwealth_2006 marital_2006g* smoking_2006g* physic_act_2006g* srh_2006g* bmibr_2006g*  cardiometcondbr_2006g* zcesd_2006 if SEX==1 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     2,698
{txt}{col 49}Average RVI{col 67}= {res}    0.0001
{txt}{col 49}Largest FMI{col 67}= {res}    0.0003
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  3.58e+07
{txt}{col 49}        avg{col 67}= {res}  2.02e+09
{txt}{col 49}        max{col 67}= {res}  8.49e+09

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0499218{col 26}{space 2} .0253418{col 37}{space 1}   -1.97{col 46}{space 3}0.049{col 54}{space 4}-.0995909{col 67}{space 3}-.0002528
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0546463{col 26}{space 2} .0255597{col 37}{space 1}   -2.14{col 46}{space 3}0.033{col 54}{space 4}-.1047423{col 67}{space 3}-.0045502
{txt}ereri_intref {c |}{col 14}{res}{space 2} .0074653{col 26}{space 2} .0031169{col 37}{space 1}    2.40{col 46}{space 3}0.017{col 54}{space 4} .0013564{col 67}{space 3} .0135743
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0018204{col 26}{space 2} .0014413{col 37}{space 1}    1.26{col 46}{space 3}0.207{col 54}{space 4}-.0010045{col 67}{space 3} .0046453
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0045613{col 26}{space 2} .0034561{col 37}{space 1}   -1.32{col 46}{space 3}0.187{col 54}{space 4}-.0113351{col 67}{space 3} .0022125
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     2,698
{txt}{col 49}Average RVI{col 67}= {res}    0.0002
{txt}{col 49}Largest FMI{col 67}= {res}    0.0005
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1.61e+07
{txt}{col 49}        avg{col 67}= {res}  5.51e+08
{txt}{col 49}        max{col 67}= {res}  1.48e+09

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} -.049416{col 26}{space 2} .0254347{col 37}{space 1}   -1.94{col 46}{space 3}0.052{col 54}{space 4}-.0992672{col 67}{space 3} .0004351
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0515294{col 26}{space 2} .0255617{col 37}{space 1}   -2.02{col 46}{space 3}0.044{col 54}{space 4}-.1016295{col 67}{space 3}-.0014294
{txt}ereri_intref {c |}{col 14}{res}{space 2} .0055075{col 26}{space 2} .0026007{col 37}{space 1}    2.12{col 46}{space 3}0.034{col 54}{space 4} .0004102{col 67}{space 3} .0106048
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0019059{col 26}{space 2} .0012649{col 37}{space 1}    1.51{col 46}{space 3}0.132{col 54}{space 4}-.0005733{col 67}{space 3} .0043851
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0053001{col 26}{space 2} .0031745{col 37}{space 1}   -1.67{col 46}{space 3}0.095{col 54}{space 4} -.011522{col 67}{space 3} .0009218
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     2,698
{txt}{col 49}Average RVI{col 67}= {res}    0.0001
{txt}{col 49}Largest FMI{col 67}= {res}    0.0004
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  2.62e+07
{txt}{col 49}        avg{col 67}= {res}  6.86e+08
{txt}{col 49}        max{col 67}= {res}  1.58e+09

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0518629{col 26}{space 2} .0253063{col 37}{space 1}   -2.05{col 46}{space 3}0.040{col 54}{space 4}-.1014623{col 67}{space 3}-.0022636
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0572273{col 26}{space 2} .0261577{col 37}{space 1}   -2.19{col 46}{space 3}0.029{col 54}{space 4}-.1084955{col 67}{space 3}-.0059591
{txt}ereri_intref {c |}{col 14}{res}{space 2} .0107801{col 26}{space 2} .0043433{col 37}{space 1}    2.48{col 46}{space 3}0.013{col 54}{space 4} .0022674{col 67}{space 3} .0192927
{txt}ereri_intmed {c |}{col 14}{res}{space 2}  .001954{col 26}{space 2} .0012319{col 37}{space 1}    1.59{col 46}{space 3}0.113{col 54}{space 4}-.0004606{col 67}{space 3} .0043685
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0073697{col 26}{space 2} .0039338{col 37}{space 1}   -1.87{col 46}{space 3}0.061{col 54}{space 4}-.0150799{col 67}{space 3} .0003405
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. 
. *****************************WOMEN*******************************
. capture drop zpoorsleep_2006 
{txt}
{com}. capture drop zpoorsleepalt_2006
{txt}
{com}. capture drop zlnhurd_odds 
{txt}
{com}. capture drop zlnexpert_odds 
{txt}
{com}. capture drop zlnlasso_odds
{txt}
{com}. foreach x of varlist poorsleep_2006 poorsleepalt_2006 lnhurd_odds lnexpert_odds lnlasso_odds {c -(}
{txt}  2{com}.         mi passive: egen z`x'=std(`x') if sample_final==1
{txt}  3{com}. {c )-}
{res}{txt}{p}
(passive variables
{res}zpoorsleep_2006 zpoorsleepalt_2006 zlnhurd_odds zlnexpert_odds zlnlasso_odds
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way zpoorsleep_2006 `m' AGE2006 SEX NonWhite  educationg* totwealth_2006 marital_2006g* smoking_2006g* physic_act_2006g* srh_2006g* bmibr_2006g*  cardiometcondbr_2006g* zcesd_2006 if SEX==2 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     3,812
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1.96e+09
{txt}{col 49}        avg{col 67}= {res}  3.83e+09
{txt}{col 49}        max{col 67}= {res}  6.85e+09

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0792418{col 26}{space 2} .0208355{col 37}{space 1}   -3.80{col 46}{space 3}0.000{col 54}{space 4}-.1200786{col 67}{space 3}-.0384049
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0730487{col 26}{space 2} .0213283{col 37}{space 1}   -3.42{col 46}{space 3}0.001{col 54}{space 4}-.1148515{col 67}{space 3}-.0312459
{txt}ereri_intref {c |}{col 14}{res}{space 2} .0037994{col 26}{space 2} .0022261{col 37}{space 1}    1.71{col 46}{space 3}0.088{col 54}{space 4}-.0005636{col 67}{space 3} .0081625
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0048881{col 26}{space 2} .0016858{col 37}{space 1}    2.90{col 46}{space 3}0.004{col 54}{space 4} .0015839{col 67}{space 3} .0081922
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0148805{col 26}{space 2} .0044637{col 37}{space 1}   -3.33{col 46}{space 3}0.001{col 54}{space 4}-.0236292{col 67}{space 3}-.0061318
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     3,812
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  3.41e+09
{txt}{col 49}        avg{col 67}= {res}  5.03e+09
{txt}{col 49}        max{col 67}= {res}  6.16e+09

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0822088{col 26}{space 2}  .020797{col 37}{space 1}   -3.95{col 46}{space 3}0.000{col 54}{space 4}-.1229701{col 67}{space 3}-.0414474
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0657938{col 26}{space 2} .0210867{col 37}{space 1}   -3.12{col 46}{space 3}0.002{col 54}{space 4}-.1071229{col 67}{space 3}-.0244647
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0045413{col 26}{space 2} .0021765{col 37}{space 1}   -2.09{col 46}{space 3}0.037{col 54}{space 4}-.0088072{col 67}{space 3}-.0002754
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0055607{col 26}{space 2} .0017512{col 37}{space 1}    3.18{col 46}{space 3}0.001{col 54}{space 4} .0021284{col 67}{space 3} .0089929
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0174343{col 26}{space 2} .0048044{col 37}{space 1}   -3.63{col 46}{space 3}0.000{col 54}{space 4}-.0268507{col 67}{space 3} -.008018
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     3,812
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  3.83e+09
{txt}{col 49}        avg{col 67}= {res}  5.79e+09
{txt}{col 49}        max{col 67}= {res}  9.04e+09

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0839315{col 26}{space 2} .0207153{col 37}{space 1}   -4.05{col 46}{space 3}0.000{col 54}{space 4}-.1245328{col 67}{space 3}-.0433302
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0610073{col 26}{space 2} .0209599{col 37}{space 1}   -2.91{col 46}{space 3}0.004{col 54}{space 4} -.102088{col 67}{space 3}-.0199267
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0080102{col 26}{space 2} .0023651{col 37}{space 1}   -3.39{col 46}{space 3}0.001{col 54}{space 4}-.0126457{col 67}{space 3}-.0033746
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0065684{col 26}{space 2} .0018497{col 37}{space 1}    3.55{col 46}{space 3}0.000{col 54}{space 4} .0029431{col 67}{space 3} .0101937
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0214824{col 26}{space 2} .0049875{col 37}{space 1}   -4.31{col 46}{space 3}0.000{col 54}{space 4}-.0312577{col 67}{space 3} -.011707
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. 
. *****SENSITIVITY ANALYSIS, WOMEN*******
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way zpoorsleepalt_2006 `m' AGE2006 SEX NonWhite  educationg* totwealth_2006 marital_2006g* smoking_2006g* physic_act_2006g* srh_2006g* bmibr_2006g*  cardiometcondbr_2006g* zcesd_2006 if SEX==2 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     3,812
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0001
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1.05e+09
{txt}{col 49}        avg{col 67}= {res}  2.35e+09
{txt}{col 49}        max{col 67}= {res}  4.26e+09

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0871932{col 26}{space 2} .0206018{col 37}{space 1}   -4.23{col 46}{space 3}0.000{col 54}{space 4}-.1275721{col 67}{space 3}-.0468144
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0803506{col 26}{space 2} .0210981{col 37}{space 1}   -3.81{col 46}{space 3}0.000{col 54}{space 4}-.1217022{col 67}{space 3} -.038999
{txt}ereri_intref {c |}{col 14}{res}{space 2} .0039831{col 26}{space 2} .0021884{col 37}{space 1}    1.82{col 46}{space 3}0.069{col 54}{space 4}-.0003061{col 67}{space 3} .0082723
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0053083{col 26}{space 2} .0017144{col 37}{space 1}    3.10{col 46}{space 3}0.002{col 54}{space 4}  .001948{col 67}{space 3} .0086685
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0161339{col 26}{space 2} .0044396{col 37}{space 1}   -3.63{col 46}{space 3}0.000{col 54}{space 4}-.0248355{col 67}{space 3}-.0074324
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     3,812
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0001
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1.18e+09
{txt}{col 49}        avg{col 67}= {res}  3.05e+09
{txt}{col 49}        max{col 67}= {res}  5.14e+09

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0896944{col 26}{space 2} .0205713{col 37}{space 1}   -4.36{col 46}{space 3}0.000{col 54}{space 4}-.1300134{col 67}{space 3}-.0493755
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0733173{col 26}{space 2} .0208685{col 37}{space 1}   -3.51{col 46}{space 3}0.000{col 54}{space 4}-.1142188{col 67}{space 3}-.0324158
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0041846{col 26}{space 2} .0021176{col 37}{space 1}   -1.98{col 46}{space 3}0.048{col 54}{space 4}-.0083349{col 67}{space 3}-.0000343
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0056334{col 26}{space 2} .0017336{col 37}{space 1}    3.25{col 46}{space 3}0.001{col 54}{space 4} .0022355{col 67}{space 3} .0090312
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0178259{col 26}{space 2} .0047459{col 37}{space 1}   -3.76{col 46}{space 3}0.000{col 54}{space 4}-.0271278{col 67}{space 3}-.0085241
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     3,812
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0001
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1.27e+09
{txt}{col 49}        avg{col 67}= {res}  3.43e+09
{txt}{col 49}        max{col 67}= {res}  5.68e+09

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0918031{col 26}{space 2} .0204745{col 37}{space 1}   -4.48{col 46}{space 3}0.000{col 54}{space 4}-.1319323{col 67}{space 3}-.0516738
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0685525{col 26}{space 2} .0207379{col 37}{space 1}   -3.31{col 46}{space 3}0.001{col 54}{space 4}-.1091981{col 67}{space 3}-.0279069
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0076524{col 26}{space 2} .0023243{col 37}{space 1}   -3.29{col 46}{space 3}0.001{col 54}{space 4} -.012208{col 67}{space 3}-.0030968
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0068409{col 26}{space 2} .0018637{col 37}{space 1}    3.67{col 46}{space 3}0.000{col 54}{space 4} .0031881{col 67}{space 3} .0104938
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0224391{col 26}{space 2} .0049456{col 37}{space 1}   -4.54{col 46}{space 3}0.000{col 54}{space 4}-.0321323{col 67}{space 3}-.0127459
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. 
. ***************************NHW*****************************************
. capture drop zpoorsleep_2006 
{txt}
{com}. capture drop zpoorsleepalt_2006
{txt}
{com}. capture drop zlnhurd_odds 
{txt}
{com}. capture drop zlnexpert_odds 
{txt}
{com}. capture drop zlnlasso_odds
{txt}
{com}. foreach x of varlist poorsleep_2006 poorsleepalt_2006 lnhurd_odds lnexpert_odds lnlasso_odds {c -(}
{txt}  2{com}.         mi passive: egen z`x'=std(`x') if sample_final==1
{txt}  3{com}. {c )-}
{res}{txt}{p}
(passive variables
{res}zpoorsleep_2006 zpoorsleepalt_2006 zlnhurd_odds zlnexpert_odds zlnlasso_odds
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. 
. 
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way zpoorsleep_2006 `m' AGE2006 SEX NonWhite  educationg* totwealth_2006 marital_2006g* smoking_2006g* physic_act_2006g* srh_2006g* bmibr_2006g*  cardiometcondbr_2006g* zcesd_2006 if NonWhite==0 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     5,324
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0001
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1.18e+09
{txt}{col 49}        avg{col 67}= {res}  2.64e+09
{txt}{col 49}        max{col 67}= {res}  5.80e+09

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0494798{col 26}{space 2}  .017994{col 37}{space 1}   -2.75{col 46}{space 3}0.006{col 54}{space 4}-.0847474{col 67}{space 3}-.0142121
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0549282{col 26}{space 2} .0185605{col 37}{space 1}   -2.96{col 46}{space 3}0.003{col 54}{space 4}-.0913061{col 67}{space 3}-.0185502
{txt}ereri_intref {c |}{col 14}{res}{space 2} .0133072{col 26}{space 2} .0030837{col 37}{space 1}    4.32{col 46}{space 3}0.000{col 54}{space 4} .0072634{col 67}{space 3} .0193511
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0041126{col 26}{space 2} .0013211{col 37}{space 1}    3.11{col 46}{space 3}0.002{col 54}{space 4} .0015232{col 67}{space 3}  .006702
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0119715{col 26}{space 2} .0033883{col 37}{space 1}   -3.53{col 46}{space 3}0.000{col 54}{space 4}-.0186123{col 67}{space 3}-.0053306
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     5,324
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0001
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1.19e+09
{txt}{col 49}        avg{col 67}= {res}  2.01e+09
{txt}{col 49}        max{col 67}= {res}  3.98e+09

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0511674{col 26}{space 2} .0179926{col 37}{space 1}   -2.84{col 46}{space 3}0.004{col 54}{space 4}-.0864323{col 67}{space 3}-.0159025
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0456814{col 26}{space 2}  .018472{col 37}{space 1}   -2.47{col 46}{space 3}0.013{col 54}{space 4}-.0818859{col 67}{space 3}-.0094769
{txt}ereri_intref {c |}{col 14}{res}{space 2} .0063426{col 26}{space 2} .0019961{col 37}{space 1}    3.18{col 46}{space 3}0.001{col 54}{space 4} .0024304{col 67}{space 3} .0102549
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0051486{col 26}{space 2} .0013631{col 37}{space 1}    3.78{col 46}{space 3}0.000{col 54}{space 4} .0024769{col 67}{space 3} .0078203
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0169772{col 26}{space 2} .0036564{col 37}{space 1}   -4.64{col 46}{space 3}0.000{col 54}{space 4}-.0241436{col 67}{space 3}-.0098108
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     5,324
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0001
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  5.08e+08
{txt}{col 49}        avg{col 67}= {res}  4.59e+09
{txt}{col 49}        max{col 67}= {res}  1.68e+10

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0523651{col 26}{space 2} .0179126{col 37}{space 1}   -2.92{col 46}{space 3}0.003{col 54}{space 4}-.0874732{col 67}{space 3}-.0172569
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0469564{col 26}{space 2} .0185279{col 37}{space 1}   -2.53{col 46}{space 3}0.011{col 54}{space 4}-.0832704{col 67}{space 3}-.0106425
{txt}ereri_intref {c |}{col 14}{res}{space 2} .0078081{col 26}{space 2} .0022414{col 37}{space 1}    3.48{col 46}{space 3}0.000{col 54}{space 4} .0034149{col 67}{space 3} .0122012
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0056646{col 26}{space 2} .0014337{col 37}{space 1}    3.95{col 46}{space 3}0.000{col 54}{space 4} .0028546{col 67}{space 3} .0084746
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0188813{col 26}{space 2} .0038424{col 37}{space 1}   -4.91{col 46}{space 3}0.000{col 54}{space 4}-.0264123{col 67}{space 3}-.0113503
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. 
. *****SENSITIVITY ANALYSIS,  NHW*******
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way zpoorsleepalt_2006 `m' AGE2006 SEX NonWhite  educationg* totwealth_2006 marital_2006g* smoking_2006g* physic_act_2006g* srh_2006g* bmibr_2006g*  cardiometcondbr_2006g* zcesd_2006 if NonWhite==0 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     5,324
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0001
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1.58e+09
{txt}{col 49}        avg{col 67}= {res}  5.83e+09
{txt}{col 49}        max{col 67}= {res}  1.21e+10

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0563906{col 26}{space 2}  .017887{col 37}{space 1}   -3.15{col 46}{space 3}0.002{col 54}{space 4}-.0914485{col 67}{space 3}-.0213328
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} -.061824{col 26}{space 2} .0184703{col 37}{space 1}   -3.35{col 46}{space 3}0.001{col 54}{space 4}-.0980252{col 67}{space 3}-.0256229
{txt}ereri_intref {c |}{col 14}{res}{space 2}  .013754{col 26}{space 2} .0031299{col 37}{space 1}    4.39{col 46}{space 3}0.000{col 54}{space 4} .0076194{col 67}{space 3} .0198885
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0045156{col 26}{space 2} .0013674{col 37}{space 1}    3.30{col 46}{space 3}0.001{col 54}{space 4} .0018356{col 67}{space 3} .0071956
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0128361{col 26}{space 2} .0033782{col 37}{space 1}   -3.80{col 46}{space 3}0.000{col 54}{space 4}-.0194573{col 67}{space 3} -.006215
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     5,324
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0001
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1.41e+09
{txt}{col 49}        avg{col 67}= {res}  5.11e+09
{txt}{col 49}        max{col 67}= {res}  1.02e+10

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0578032{col 26}{space 2} .0178991{col 37}{space 1}   -3.23{col 46}{space 3}0.001{col 54}{space 4}-.0928849{col 67}{space 3}-.0227215
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0527225{col 26}{space 2} .0183726{col 37}{space 1}   -2.87{col 46}{space 3}0.004{col 54}{space 4}-.0887322{col 67}{space 3}-.0167129
{txt}ereri_intref {c |}{col 14}{res}{space 2} .0065844{col 26}{space 2} .0020024{col 37}{space 1}    3.29{col 46}{space 3}0.001{col 54}{space 4} .0026598{col 67}{space 3}  .010509
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0051515{col 26}{space 2}  .001365{col 37}{space 1}    3.77{col 46}{space 3}0.000{col 54}{space 4} .0024762{col 67}{space 3} .0078268
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0168165{col 26}{space 2} .0036252{col 37}{space 1}   -4.64{col 46}{space 3}0.000{col 54}{space 4}-.0239217{col 67}{space 3}-.0097113
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     5,324
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0001
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  5.87e+08
{txt}{col 49}        avg{col 67}= {res}  7.52e+09
{txt}{col 49}        max{col 67}= {res}  1.31e+10

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0593195{col 26}{space 2} .0178148{col 37}{space 1}   -3.33{col 46}{space 3}0.001{col 54}{space 4}-.0942359{col 67}{space 3}-.0244032
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0541993{col 26}{space 2}  .018439{col 37}{space 1}   -2.94{col 46}{space 3}0.003{col 54}{space 4} -.090339{col 67}{space 3}-.0180596
{txt}ereri_intref {c |}{col 14}{res}{space 2} .0081853{col 26}{space 2} .0022739{col 37}{space 1}    3.60{col 46}{space 3}0.000{col 54}{space 4} .0037285{col 67}{space 3} .0126421
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0058666{col 26}{space 2} .0014602{col 37}{space 1}    4.02{col 46}{space 3}0.000{col 54}{space 4} .0030046{col 67}{space 3} .0087285
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0191721{col 26}{space 2}  .003814{col 37}{space 1}   -5.03{col 46}{space 3}0.000{col 54}{space 4}-.0266473{col 67}{space 3}-.0116969
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. ***************************Non-White*************************************
. capture drop zpoorsleep_2006 
{txt}
{com}. capture drop zpoorsleepalt_2006
{txt}
{com}. capture drop zlnhurd_odds 
{txt}
{com}. capture drop zlnexpert_odds 
{txt}
{com}. capture drop zlnlasso_odds
{txt}
{com}. foreach x of varlist poorsleep_2006 poorsleepalt_2006 lnhurd_odds lnexpert_odds lnlasso_odds {c -(}
{txt}  2{com}.         mi passive: egen z`x'=std(`x') if sample_final==1
{txt}  3{com}. {c )-}
{res}{txt}{p}
(passive variables
{res}zpoorsleep_2006 zpoorsleepalt_2006 zlnhurd_odds zlnexpert_odds zlnlasso_odds
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)
{res}{txt}{it:m}=0:
(36,570 missing values generated)
{it:m}=1:
(36,570 missing values generated)
{it:m}=2:
(36,570 missing values generated)
{it:m}=3:
(36,570 missing values generated)
{it:m}=4:
(36,570 missing values generated)
{it:m}=5:
(36,570 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_6434_000002.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. 
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way zpoorsleep_2006 `m' AGE2006 SEX NonWhite  educationg* totwealth_2006 marital_2006g* smoking_2006g* physic_act_2006g* srh_2006g* bmibr_2006g*  cardiometcondbr_2006g* zcesd_2006 if NonWhite==1 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     1,186
{txt}{col 49}Average RVI{col 67}= {res}    0.0003
{txt}{col 49}Largest FMI{col 67}= {res}    0.0011
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}3355538.16
{txt}{col 49}        avg{col 67}= {res}  5.84e+09
{txt}{col 49}        max{col 67}= {res}  2.53e+10

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.1308157{col 26}{space 2} .0374302{col 37}{space 1}   -3.49{col 46}{space 3}0.000{col 54}{space 4}-.2041776{col 67}{space 3}-.0574537
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.1105529{col 26}{space 2} .0378512{col 37}{space 1}   -2.92{col 46}{space 3}0.003{col 54}{space 4}-.1847398{col 67}{space 3}-.0363659
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0161959{col 26}{space 2} .0105063{col 37}{space 1}   -1.54{col 46}{space 3}0.123{col 54}{space 4} -.036788{col 67}{space 3} .0043961
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0014922{col 26}{space 2} .0017496{col 37}{space 1}    0.85{col 46}{space 3}0.394{col 54}{space 4}-.0019369{col 67}{space 3} .0049213
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0055591{col 26}{space 2} .0057113{col 37}{space 1}   -0.97{col 46}{space 3}0.330{col 54}{space 4} -.016753{col 67}{space 3} .0056349
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     1,186
{txt}{col 49}Average RVI{col 67}= {res}    0.0007
{txt}{col 49}Largest FMI{col 67}= {res}    0.0025
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}651,141.36
{txt}{col 49}        avg{col 67}= {res}  1.51e+11
{txt}{col 49}        max{col 67}= {res}  7.51e+11

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.1300898{col 26}{space 2} .0374226{col 37}{space 1}   -3.48{col 46}{space 3}0.001{col 54}{space 4}-.2034369{col 67}{space 3}-.0567428
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.1191736{col 26}{space 2} .0377776{col 37}{space 1}   -3.15{col 46}{space 3}0.002{col 54}{space 4}-.1932162{col 67}{space 3}-.0451309
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0101299{col 26}{space 2} .0086784{col 37}{space 1}   -1.17{col 46}{space 3}0.243{col 54}{space 4}-.0271393{col 67}{space 3} .0068795
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0002406{col 26}{space 2}  .001162{col 37}{space 1}    0.21{col 46}{space 3}0.836{col 54}{space 4}-.0020369{col 67}{space 3} .0025181
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0010269{col 26}{space 2} .0049001{col 37}{space 1}   -0.21{col 46}{space 3}0.834{col 54}{space 4}-.0106309{col 67}{space 3} .0085771
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     1,186
{txt}{col 49}Average RVI{col 67}= {res}    0.0003
{txt}{col 49}Largest FMI{col 67}= {res}    0.0009
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}4673663.36
{txt}{col 49}        avg{col 67}= {res}  3.07e+10
{txt}{col 49}        max{col 67}= {res}  1.49e+11

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.1338002{col 26}{space 2} .0373552{col 37}{space 1}   -3.58{col 46}{space 3}0.000{col 54}{space 4} -.207015{col 67}{space 3}-.0605854
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.1238971{col 26}{space 2} .0367782{col 37}{space 1}   -3.37{col 46}{space 3}0.001{col 54}{space 4} -.195981{col 67}{space 3}-.0518131
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0058766{col 26}{space 2} .0086654{col 37}{space 1}   -0.68{col 46}{space 3}0.498{col 54}{space 4}-.0228605{col 67}{space 3} .0111073
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0005926{col 26}{space 2} .0010317{col 37}{space 1}    0.57{col 46}{space 3}0.566{col 54}{space 4}-.0014295{col 67}{space 3} .0026146
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0046191{col 26}{space 2} .0062616{col 37}{space 1}   -0.74{col 46}{space 3}0.461{col 54}{space 4}-.0168917{col 67}{space 3} .0076535
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. *****SENSITIVITY ANALYSIS,  Non-White*******
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way zpoorsleepalt_2006 `m' AGE2006 SEX NonWhite  educationg* totwealth_2006 marital_2006g* smoking_2006g* physic_act_2006g* srh_2006g* bmibr_2006g*  cardiometcondbr_2006g* zcesd_2006 if NonWhite==1 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     1,186
{txt}{col 49}Average RVI{col 67}= {res}    0.0003
{txt}{col 49}Largest FMI{col 67}= {res}    0.0012
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}3027996.90
{txt}{col 49}        avg{col 67}= {res}  4.61e+09
{txt}{col 49}        max{col 67}= {res}  1.98e+10

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.1310776{col 26}{space 2} .0365923{col 37}{space 1}   -3.58{col 46}{space 3}0.000{col 54}{space 4}-.2027973{col 67}{space 3}-.0593579
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.1111045{col 26}{space 2} .0371344{col 37}{space 1}   -2.99{col 46}{space 3}0.003{col 54}{space 4}-.1838865{col 67}{space 3}-.0383225
{txt}ereri_intref {c |}{col 14}{res}{space 2} -.015845{col 26}{space 2} .0103624{col 37}{space 1}   -1.53{col 46}{space 3}0.126{col 54}{space 4} -.036155{col 67}{space 3}  .004465
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0014531{col 26}{space 2} .0016788{col 37}{space 1}    0.87{col 46}{space 3}0.387{col 54}{space 4}-.0018373{col 67}{space 3} .0047435
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0055812{col 26}{space 2} .0056183{col 37}{space 1}   -0.99{col 46}{space 3}0.321{col 54}{space 4}-.0165929{col 67}{space 3} .0054305
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     1,186
{txt}{col 49}Average RVI{col 67}= {res}    0.0006
{txt}{col 49}Largest FMI{col 67}= {res}    0.0026
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}593,379.03
{txt}{col 49}        avg{col 67}= {res}  5.37e+10
{txt}{col 49}        max{col 67}= {res}  2.60e+11

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.1305678{col 26}{space 2}  .036569{col 37}{space 1}   -3.57{col 46}{space 3}0.000{col 54}{space 4}-.2022418{col 67}{space 3}-.0588939
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.1197367{col 26}{space 2} .0370739{col 37}{space 1}   -3.23{col 46}{space 3}0.001{col 54}{space 4}-.1924002{col 67}{space 3}-.0470732
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0103081{col 26}{space 2} .0085493{col 37}{space 1}   -1.21{col 46}{space 3}0.228{col 54}{space 4}-.0270644{col 67}{space 3} .0064482
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0001613{col 26}{space 2} .0011436{col 37}{space 1}    0.14{col 46}{space 3}0.888{col 54}{space 4}-.0020801{col 67}{space 3} .0024027
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0006843{col 26}{space 2} .0048254{col 37}{space 1}   -0.14{col 46}{space 3}0.887{col 54}{space 4}-.0101419{col 67}{space 3} .0087732
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2006 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2006 marital_2006g1 marital_2006g2 marital_2006g3 marital_2006g4 smoking_2006g1 smoking_2006g2 smoking_2006g3 physic_act_2006g1 physic_act_2006g2 physic_act_2006g3 srh_2006g1 srh_2006g2 bmibr_2006g1 bmibr_2006g2 bmibr_2006g3 cardiometcondbr_2006g1 cardiometcondbr_2006g2 cardiometcondbr_2006g3 zcesd_2006 were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     1,186
{txt}{col 49}Average RVI{col 67}= {res}    0.0003
{txt}{col 49}Largest FMI{col 67}= {res}    0.0010
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}4317459.70
{txt}{col 49}        avg{col 67}= {res}  1.88e+10
{txt}{col 49}        max{col 67}= {res}  9.04e+10

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} -.134643{col 26}{space 2} .0364571{col 37}{space 1}   -3.69{col 46}{space 3}0.000{col 54}{space 4}-.2060977{col 67}{space 3}-.0631884
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.1245663{col 26}{space 2}  .036056{col 37}{space 1}   -3.45{col 46}{space 3}0.001{col 54}{space 4}-.1952349{col 67}{space 3}-.0538978
{txt}ereri_intref {c |}{col 14}{res}{space 2} -.005761{col 26}{space 2} .0085282{col 37}{space 1}   -0.68{col 46}{space 3}0.499{col 54}{space 4} -.022476{col 67}{space 3} .0109539
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0006235{col 26}{space 2} .0010289{col 37}{space 1}    0.61{col 46}{space 3}0.544{col 54}{space 4}-.0013931{col 67}{space 3} .0026402
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0049392{col 26}{space 2} .0061316{col 37}{space 1}   -0.81{col 46}{space 3}0.421{col 54}{space 4} -.016957{col 67}{space 3} .0070786
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save finaldata_imputed_FINAL, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_FINAL.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}